{
  "name": "ENEB",
  "courses": [
    {
      "code": "ENEB304",
      "name": "Microelectronics and Sensors",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "An overview of basic Internet of Things (IOT) architecture, core IOT hardware enablers, and IOT sensors and their implementation. This course covers commonly used analog amplifier designs and biasing, as well as characterization in the frequency and time domains. In addition, this course discusses the physical principles in RF communications as it relates to wireless personal and local networks (WPAN/WLAN) and short-range communication systems.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Romel Gomez"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      2,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "3335"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      12,
                      0,
                      "Pm"
                    ],
                    [
                      12,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "3335"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENEB345",
      "name": "Probability &amp; Statistical Inference",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "This is a foundational course on probability and statistics for data science and connected embedded systems.  This covers basic statistics and probability theory, including random variables, standard distributions, moments, law of large numbers and central limit theorem, sampling methods, estimation of parameters, testing of hypotheses. The course also includes the mathematical theory of randomness, and applications to big data analysis and analysis in the presence of uncertainty, and applications to machine learning algorithms.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Nestor Michael Tiglao"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      12,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "5321"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENEB352",
      "name": "Introduction to Networks and Protocols",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "An introduction to the principles of computer networking and covers the architecture and operation of the TCP/IP protocol stack. Topics will include fundamental networking concepts, the layers of the TCP/IP protocol stack, the packet structure and operation of each layer with detailed discussion on reliable data transfer, flow control, congestion control, routing algorithms, error detection, Local Area Networks (LANs), and multiple access protocols. The course will also cover wireless protocols relevant to Internet of Things (IoT) such as WLAN (IEEE 802.11), Zigbee (IEEE 802.15.4), and Bluetooth as well as some popular IoT application-layer and network-layer protocols including CoAP, AMQP, MQTT, XMPP and 6LoWPAN. As a part of the course work, the students will attend lab sessions where they will learn how to capture and analyze network traffic, how to configure networking functions on Linux systems, and how to operate and configure routers using Juniper Networks devices in a real-world lab environment.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Zoltan Safar"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      12,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "3210"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      2,
                      30,
                      "Pm"
                    ],
                    [
                      5,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "3210"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENEB353",
      "name": "Computer Organization for Embedded Systems",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Overview of the basic principles of computer organization and design with emphasis on low resource microcontrollers common in IoT applications. The topics include assembly and machine instructions, data-path and controller design, pipelining and memory hierarchy.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Manoj Franklin"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      12,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "5332"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      1,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "5332"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENEB355",
      "name": "Algorithms in Python",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "A study of fundamental algorithmic problem-solving techniques in Python for today's large-scale computer systems as well as microcontrollers. Algorithms are instructions for solving problems and data structures are strategies for organizing information on computers. Efficient algorithms require appropriate data structures, and vice versa. Students will learn about the algorithms and data structures that form the building blocks of Python programming language. Student will also learn to analyze the cost of algorithms, according to how their running time or space requirements grows as data size grows.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Nestor Michael Tiglao"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "3321"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      20,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "3202"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENEB408B",
      "name": "Capstone Design Lab; Capstone Design Lab II",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Jerry Wu"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      3,
                      45,
                      "Pm"
                    ],
                    [
                      5,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "1119"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      4,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "5202"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENEB443",
      "name": "Hardware/Software Security for Embedded Systems",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "This course will provide an in-depth understanding of systems level software and hardware in designing industry-standard secured embedded systems. It aims to provide a comprehensive systems view of security, including hardware, platform software such as operating systems and integrated development environments, software development process, data protection protocols, and some aspects of cryptography. To goal is to expose students on how to develop embedded software and properly utilize platform components to ensure the highest levels of security.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "George Zaki"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      5,
                      30,
                      "Pm"
                    ],
                    [
                      8,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "3202"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENEB453",
      "name": "Web-Based Application Development",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Introduction to cloud computing, computer programming in the context of developing full-featured dynamic websites. Uses a problem-solving approach to teach basics of program design and implementation using JavaScript; relates these skills to the creation of dynamic websites; then explores both the potential and limits of web-based information sources for use in research. This course provides a practical introduction to full-stack web development using PHP and JavaScript. The course will start with HTML/CSS/JavaScript to cover the client-side of applications. Then, it will move on to the server-side with PHP and integrating with a MySQL database to create a complete web application.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Nestor Michael Tiglao"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      12,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "3202"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENEB455",
      "name": "Advanced FPGA System Design using Verilog for Embedded Systems",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "A project-oriented course on digital system design using Verilog hardware description language (HDL) in an industry-standard design environment appropriate for embedded systems. Students will implement real-world designs in field programmable gate arrays (FPGAs) as well as test and optimize the FPGA. Students will also work in teams on multiple, medium-scale digital system design projects and make oral presentations and written reports.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Jerry Wu"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "1119"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "2322"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENEB456",
      "name": "Machine Learning Tools",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "A broad introduction to machine learning and statistical pattern recognition tools. The course will teach students to model existing data and to forecast future behaviors, outcomes, and trends. It will be taught using the Azure Machine Learning Studio that provides an integrated, end-to-end data science and advanced analytics solution. It will enable students to prepare data, develop experiments, and deploy models at cloud scale. Topics include: supervised learning (Bayesian learning and classifier, parametric/non-parameteric learning, discriminant functions, support vector machines, neural networks, deep learning networks); unsupervised learning (clustering, dimensionality reduction, auto-encoders). The course will also discuss recent applications of machine learning, such as computer vision, data mining, autonomous navigation, and speech recognition. Hands-on: implementation of Tensorflow Algorithm on TPU board.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Nestor Michael Tiglao"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      12,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "3210"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      4,
                      30,
                      "Pm"
                    ],
                    [
                      6,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "3210"
                ]
              }
            }
          ]
        }
      ]
    }
  ]
}