{
  "name": "AAST",
  "courses": [
    {
      "code": "AAST200",
      "name": "Introduction to Asian American Studies",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS",
        "DVUP"
      ],
      "description": "The aggregate experience of Asian Pacific Americans, from developments in the countries of origin to their contemporary issues. The histories of Asian Pacific American groups as well as culture, politics, the media, and stereotypes, viewed from an interdisciplinary perspective.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Julie Park"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TWS",
                  "0236"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Binod Paudyal"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "ASY",
                  "1213"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "AAST201",
      "name": "Asian American History",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS",
        "DVUP"
      ],
      "description": "Introduction to the history of Asian Americans and Asians in the United States and the Americas and to the field of Asian American Studies, from an interdisciplinary perspective. Topics include theories of race and ethnicity; Asian migration and diaspora to the Americas; Asian American work and labor issues; gender, family, and communities; nationalism and nativism, and anti-Asian movements; Asian Americans in World War II, the Cold War, and the issues in the civil rights &amp; post-civil rights era.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Madeline Hsu"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "KEY",
                  "0103"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "AAST233",
      "name": "Introduction to Asian American Literature",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHU",
        "DVUP"
      ],
      "description": "A survey of Asian American literature with an emphasis on recurrent themes and historical context.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Jennifer Cho"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "EDU",
                  "1121"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "AAST262",
      "name": "Asian American Psychology",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "An overview of how socio-cultural influences impact the development and psychological health of Asian Americans. Other topics include how minority group status, adaptation and identity development influence various aspects of psychological functioning; the role of historic systematic racism; and, how the COVID-19 pandemic has negatively impacted Asian Americans. Students develop a deeper understanding of the role of stereotypes and racism, acculturation, racial identity development, cultural values, gender socialization, behavioral norms, family roles, stressors and social support systems on the mental health, well-being and health of Asian Americans.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Derek Iwamoto"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      12,
                      30,
                      "Pm"
                    ],
                    [
                      1,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SKN",
                  "0104"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "AAST298G",
      "name": "Special Topics in Asian American Studies; Asian American Foodways",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Explores how nineteenth century to contemporary discourses about Asian food cultures reflect the place and perceptions of Asians in the U.S. at different historical moments. Also considers how Asian American identities, memories, intimacies, and relations to power are negotiated through food practices in public and private spaces, creative entrepreneurship, and food writing and media.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Jennifer Cho"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "TWS",
                  "0214"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "AAST351",
      "name": "Asian Americans and Media",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSSP",
        "DVUP"
      ],
      "description": "From yellow peril invaders to model minority allies, Asian Americans have crafted their own dynamic cultural expressions in a number of media from film, television, and music to fashion, sports, and food that reveal and contest the contradictions of the U.S. nation-state. Asian American culture also uniquely sits at the nexus of immigration flows and digital technologies, providing a transnational lens to view the US place in the world. This advanced course, then, will introduce students to the study and practice of Asian American cyktyre as multiple , hybrid, and heterogeneous. It will do so through three sections: section one will introduce students to classical, cultural, and media concepts as well as relevant keywords outlined by Asian American Studies scholars; section two will review the work of Asian American cultural theorists; section three will focus on analyses of particular Asian American cultural productions. In doing so, students will gain an understanding of the shifting and interlocking tensions among the local, the national, and the global that form the cultural geographies of Asian America.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Binod Paudyal"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "ASY",
                  "1213"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "AAST378",
      "name": "Experiential Learning; Experiential Learning",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Janelle Wong"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Joan Hong"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        }
      ]
    },
    {
      "code": "AAST388",
      "name": "Independent Research; Independent Research",
      "credits": {
        "Range": [
          1,
          3
        ]
      },
      "gen_eds": null,
      "description": "Prerequisite: permission of department.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Janelle Wong"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Binod Paudyal"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        },
        {
          "sec_code": "0301",
          "instructors": [
            "Jennifer Cho"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        },
        {
          "sec_code": "0401",
          "instructors": [
            "Instructor: TBA"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        },
        {
          "sec_code": "0501",
          "instructors": [
            "Joan Hong"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        }
      ]
    },
    {
      "code": "AAST394",
      "name": "Growing Up Asian American: The Asian Immigrant Family and the Second Generation",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DVCC"
      ],
      "description": "An interdisciplinary course examines the experiences of children of Asian immigrants in the U.S., focusing on intergenerational dynamics in the Asian immigrant family, their intersections with race, gender, class, sexuality, and religion, and how these shape second-generation Asian American life. Topics include identity and personhood, the model minority myth and education, work and leisure, language and communication, filiality and disownment, mental health and suicide.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Joan Hong"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      3,
                      0,
                      "Pm"
                    ],
                    [
                      4,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TWS",
                  "1107"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "AAST421",
      "name": "Asian American Public Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DVCC"
      ],
      "description": "Using Asian Pacific Americans as a case study, this course will analyze the development of public policy in America. Each week, topics such as community development, voting rights, and the movement to redress the wartime internment of Japanese Americans will serve as backdrops for discussion. We will explore the policy-making roles of legislators, judges, local and national political leaders, journalists, writers, unions, social movements, and community organizations.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Philip Nash"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      5,
                      0,
                      "Pm"
                    ],
                    [
                      7,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1119"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "AAST440",
      "name": "South Asian American Literature and Culture",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHU",
        "DVUP"
      ],
      "description": "Examines writing by South Asian American authors and authors writing about South Asian American issues. It explores major South Asian diaspora themes, considering how migration, war, the events of 9/11, global capitalism, and the changing socio-political and racial scene have affected South Asians in the United States. We will use a transnational approach to consider how writers and filmmakers explore gender, class, religious, caste, and other differences amongst South Asian Americans. We will also examine the place of South Asian Americans in relation to other Asian American populations. We will consider how South Asian American texts disrupt traditional literary classifications based on national identities by reflecting the complex global conditions, imperialistic and capitalistic expansion, and interconnectedness of peoples, nations, and cultures that have transformed American literature and conceptions of American identity.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Binod Paudyal"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "KEY",
                  "0117"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "AAST498G",
      "name": "Advanced Topics in Asian American Studies; Asian American Women and Gender",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Cross-listed with WGSS498I. Credit only granted for AAST498G or WGSS498I.<br><br> Examines Asian American identities through a transnational, gendered framework, and studies the impacts of exclusion and immigration laws and U.S. histories of (neo)colonialism and war on domestic, sexual, repr oductive, and economic labor of Asian American women. Also explores Asia n American feminism in context of Women of Color feminisms and queer of color critique.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Jennifer Cho"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1101"
                ]
              }
            }
          ]
        }
      ]
    }
  ]
}