{
  "name": "HNUH",
  "courses": [
    {
      "code": "HNUH100",
      "name": "Gateway Seminar",
      "credits": {
        "Amount": 1
      },
      "gen_eds": null,
      "description": "First-semester orientation and exploration seminar required of all UH students.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Natalie Kress",
            "Christine Jones"
          ],
          "class_meetings": [
            "OnlineAsync"
          ]
        }
      ]
    },
    {
      "code": "HNUH218B",
      "name": "Frederick Douglass's America",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS",
        "SCIS"
      ],
      "description": "What does it mean to be free in the United States? The concept of freedom was embedded in the nation's political culture in the Declaration of Independence, and it has remained a cherished and contested ideal. We can interrogate this concept through the life and times of Frederick Douglass (1818-1895), who dreamed eloquently of freedom, thought carefully about its limits, and worked ardently to build a firmer freedom for a broader population. With Douglass as our guide, we will examine the survival of slavery in a nation built on freedom, images of the expanding United States as a land of opportunity, and the complex meanings and tremendous costs of freedom struggles during the nineteenth century. This history will push you to think critically about the contested concepts that shape our lives, and to consider the values and the perils of a society that positions freedom as its highest ideal.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Christopher Bonner"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      10,
                      0,
                      "Am"
                    ],
                    [
                      10,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "CCC",
                  "1100"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      9,
                      0,
                      "Am"
                    ],
                    [
                      9,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "PLS",
                  "1117"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0102",
          "instructors": [
            "Christopher Bonner"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      10,
                      0,
                      "Am"
                    ],
                    [
                      10,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "CCC",
                  "1100"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      10,
                      0,
                      "Am"
                    ],
                    [
                      10,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "PLS",
                  "1117"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0103",
          "instructors": [
            "Christopher Bonner"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      10,
                      0,
                      "Am"
                    ],
                    [
                      10,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "CCC",
                  "1100"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      11,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "PLS",
                  "1117"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH218J",
      "name": "The Free Internet",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Free speech, free porn, free shipping... What does it mean for something to be 'free' online and how does our participation in the internet liberate or constrain our identities, bodies, and relation with others? In this class we'll talk about the economics, politics, and culture of the internet to assess how values and value are made and circulated within its technologies. We'll focus on the many ways the term 'free' operates in this context, notably, around the ability to create, distribute, and access information. Centered on the US with a comparative eye on the global internet ecosystem, this seminar asks: Where do the rights and responsibilities for a \"free internet\" come from, and to whom do they apply? What identities and bodies are at risk or rewarded in these systems? What are the choices individuals, platforms, and governments must make to determine the future of the internet and the freedom of the people who build and use it?",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Alexandra Harlig"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "YDH",
                  "0104F"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Alexandra Harlig"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "YDH",
                  "0104F"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH218W",
      "name": "Freedom and Captivity: Prisons, Punishment, and Citizenship",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS"
      ],
      "description": "What does freedom mean if you're incarcerated? How is freedom, citizenship, and social membership mediated through the power of the state? What are the implications of punishment on how freedom is constructed, understood, and experienced? The United States purports to be a beacon of freedom while simultaneously incarcerating more people than any other country in the world. Throughout the course, we will discuss the writings of scholars, theorists, historians, and--most importantly--incarcerated people to interrogate the concept of \"freedom\" from the vantage point of the prison. Students will use these insights to analyze the complex tensions and relationships between social ideals and practice.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Robert Stewart"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      4,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "0135"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH219P",
      "name": "Transform Maryland: Management Consulting Internship",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSSP"
      ],
      "description": "This three-credit internship, open to all majors, offers a fully immersive consulting experience that affords undergraduate students the opportunity to engage with a real client. Working in dynamic teams, students learn advanced management consulting strategies, and apply critical thinking and solution design to real world cases, all while developing general professional acumen. The internship innovates real University of Maryland business processes. Managed by senior members of the DIT's Enterprise Planning and Continuous Improvement unit, the internship matches teams with top-tier professionals and a senior university administrator as a project client. Supported by professional coaching from practicing talent managers and management consultants, students research and benchmark against other schools, analyze and synthesize results, and formulate actionable recommendations for the client. The internship culminates in a recommendation pitch to campus leadership.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Megan MacKenzie",
            "Joseph Drasin"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        }
      ]
    },
    {
      "code": "HNUH228B",
      "name": "Redesigning Life: Prospects and Consequences",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSNS",
        "SCIS"
      ],
      "description": "What is at stake for our world as humans seek to redesign biological organisms? Biotechnology advances are enabling us to read, edit and write genomes, including our own. This revolution has been fueled by the quest to understand and cure disease. Yet, these innovations have far-reaching consequences beyond medicine and will reshape our world in ways we can only imagine - or fear. The course will challenge students to confront the risks and rewards for them, their family, their community, and their future, as biotechnology moves out of specialized laboratories and into homes. A demystifying, low-tech approach will introduce them to contemporary genome redesign, clarifying the current limitations and future goals of the field. Students will debate whether redesigning plants and animals will enhance or inhibit momentum in human genome engineering, and formulate their own arguments about who should be able to use these tools and where, who decides, and how much society is willing to risk.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Edward Eisenstein"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      12,
                      30,
                      "Pm"
                    ],
                    [
                      1,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "PLS",
                  "1140"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH228U",
      "name": "A Life Worth Living: The Legacy of Eugenics in Genetics",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHU"
      ],
      "description": "Should parents be able to choose their child's eye color? Or alter their child's genome to eliminate a hereditary disability? While these might seem like different concerns, both are eugenic questions. In this class students will learn about the legacy of eugenics and its role in the development of genetics by analyzing science fiction works through the lens of disability studies. We'll explore the past to identify who has historically been considered \"fit\" and look to the future to consider what kinds of embodiments, and life experiences, society seems willing to let disappear.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Leigha McReynolds"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "YDH",
                  "0104A"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Leigha McReynolds"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "YDH",
                  "0104A"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH228W",
      "name": "Planetary Protection vs. Planetary Imperialism",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSNS"
      ],
      "description": "International space agencies, such as NASA, ESA, and CNSA, continue to push the boundaries of deep space exploration, buoyed by public excitement, scientific ambition, and political motivation. However, the invasion of alien environments warrants an ethical consideration. What are the risks of forward contamination? What are the potential consequences of reverse contamination? How do we avoid a \"space race\" incentivized by imperialism? What happens next if we do discover life on another planetary body? This course equips students to grapple with such questions in light of the current state of planetary science, world affairs, and the near-term prospects for the commercialization of spaceflight.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Ricardo Arevalo"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "JMZ",
                  "0125"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH229P",
      "name": "Climate in Crisis: Strategy and Advocacy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSSP"
      ],
      "description": "This theory and practice track examines theoretical frameworks for understanding climate change and concrete cases that shed light on the complexity of managing it. In this, the practical component of the Climate in Crisis track, we explore several domestic energy and climate policy case studies, examining the competing roles played by various interest groups that influence legislative and regulatory outcomes, with a focus on differing organizational advocacy strategies. Once we have mastered organizational advocacy strategies, students bring those tools to bear on the most recent US Federal policy mandates and legislation. In 229T, students will complement this work with a deep dive into the nature of public goods and climate change policy, among other crucial considerations.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Tyson Slocum"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      3,
                      0,
                      "Pm"
                    ],
                    [
                      5,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SPH",
                  "0307"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH238B",
      "name": "Systemic Racism in Public Opinion and Policy Attitudes",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS",
        "SCIS"
      ],
      "description": "If we believe that racism is bad, why do we still support racist policies? No matter how hard we work to end it, the challenge of racism seems here to stay. Though attitudes toward racial segregation in schools have changed, schools are more racially isolated than ever. There is a disconnect in American public life between support for the idea of equality and resistance to policies aimed at addressing racism, and a deep divide over how to eliminate inequality. This course focuses on public opinion and how these attitudes inform public policy. Can we address systemic inequality through public engagement and by changing the national narrative with the support of evidence? Does change come from shifting views or shifting policies? Students will explore these issues through a case study on racial equity in the Honors College. By developing skills in evidence-based op-ed writing and survey-based experiments, students will add their voices to these pressing public debates of our time.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Janelle Wong"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      10,
                      0,
                      "Am"
                    ],
                    [
                      11,
                      15,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "TWS",
                  "0320"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH238U",
      "name": "Unequal Opportunity? Race and the Future of American Education",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS"
      ],
      "description": "America's schools are dynamic microcosms of society at large. They simultaneously reflect, reproduce, and shape what happens outside of the classroom, including the many ways that racism affects us all. The educational mechanisms that operate for the benefit of some and to the detriment of others are often hard to see, often because they are hidden in plain sight. For example, national tests are standardized. When racialized differences in test scores appear, they are called \"achievement gaps\" and the disparity is attributed to essential differences or cultural deficiency rather than inequitable access and opportunity. In this course students will learn methods to critically examine such commonplace notions as the achievement gap and to document their effects on society. They will also develop strategies for self-reflection that enable them to confront inequity in their own educational experience and work to create change.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Robert Graham"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      2,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "YDH",
                  "104A"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Robert Graham"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      3,
                      0,
                      "Pm"
                    ],
                    [
                      4,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "YDH",
                  "104A"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH238W",
      "name": "Monsters and Racism: Black Horror and Speculative Fiction",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHU"
      ],
      "description": "The previous decade has been considered a renaissance for Black Horror. From Get Out to Lovecraft Country, the genre has enjoyed unprecedented mainstream media buzz and accolades. This course looks at contemporary Black horror and speculative fiction as cultural texts which put into question our notions of human(e) and inhuman(e) through critiques of white supremacy and accompanying oppressions. Students will learn a host of critical skills through close reading and analysis of literature and film by Black creators such as Jordan Peele, Misha Green, Toni Morrison, Jewelle Gomez, and Octavia Butler. With the ability to interpret cultural texts using literary criticism, film analysis, history, cultural studies, ethnic studies, feminist theory, and the social sciences, students will connect these texts to continuing historical and contemporary issues of racial and cultural oppression such as medical discrimination, policing and criminalization, misogynoir, and racialized capitalism.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Sydney Lewis"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "PAC",
                  "1815"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH248B",
      "name": "Setting the Table: The Challenges and Opportunities for Sustainable Agriculture",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSSP",
        "SCIS"
      ],
      "description": "What will the farm of the future look like? Our current food system is plagued with paradoxes. An estimated 41.2 million Americans are classified as food insecure, but we produce 4,000 calories per person per day. Between 2008 and 2012, 1.6 million acres of long-term grasslands were converted to crop production, yet more than 350,000 acres of farmland were lost to development annually. This course will investigate what determines the food we eat and how we can make changes today that will improve both food access and the environment for future generations. Students will learn agribusiness, as well as alternative food movements and regenerative agriculture. They will meet experts from the USDA and Maryland producers. By growing their own vegetables, tracking food consumption, and exploring family history linked to farming, students will leave the course as conscious consumers empowered to navigate food system reform.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Stephanie Yarwood"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "EGR",
                  "1108"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH248U",
      "name": "The Loneliness Crisis: Origins and Solutions",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS",
        "DVUP"
      ],
      "description": "In 2017, U.S. Surgeon General Vivek Murthy deemed loneliness an \"epidemic.\" Despite the rise of social media that is meant to foster connection, over 23% of adults report being lonely and social networks have been shrinking for decades. Like a viral epidemic, widespread loneliness has grave consequences. Loneliness shortens lifespans at a rate akin to smoking 15 cigarettes a day and predicts mortality risk better than poor diet or lack of exercise. This course will explore how loneliness became a crisis--exploring potential drivers of loneliness like social media, systemic racism, homophobia, and the rise of romantic love--and what we can do about it. It will end with students developing interventions to diminish loneliness and practicing skills to connect with one another.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Marisa Franco"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "YDH",
                  "0104A"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Marisa Franco"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "YDH",
                  "0104A"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH248W",
      "name": "Save the Soil, Save the World",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Canada, Maui, eastern Libya. We are witnessing the burning and flooding of our planet. A major influence on these catastrophes are the greenhouse gasses presently trapping too much heat close to earth and warming it beyond acceptable limits. Our survival depends on reversing this trend. But how? An answer lies just beneath our feet. According to the UN Food and Agriculture Organization, the top 30 cm of the world's soil contains about twice as much carbon as the entire atmosphere and more than is stored in all the vegetation on earth. Soil turns out to be a great way to keep carbon out of the atmosphere. This course explores the critical role soils play not just in our food production, but also in our efforts to prevent the worst effects of climate change. With their knowledge of the drivers of climate change and soil characteristics, students in this course will research and propose more sustainable soil management practices to help mitigate climate change and save the world.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Eni Baballari"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "YDH",
                  "0104F"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH249P",
      "name": "National Security: US Foreign Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Following the terrorist attacks of September 11, 2001, the U.S. launched a major effort to dismantle the Taliban and create a sustainable democracy in Afghanistan. In 2021, the Taliban took control of the country. Was the U.S. effort doomed to fail? To answer this question, UH students will partner with peers at the American University of Afghanistan through a virtual global classroom to examine the lessons learned from the U.S. and international presence in Afghanistan over the past 20 years. Through reading assignments and virtual meetings with former senior U.S. and Afghan officials, students will examine the reasons behind the downfall of the country and analyze whether the outcome could have been changed. Students are not expected to have any prior knowledge about the conflict in Afghanistan. This course is self-contained but paired with HNUH249T in the National Security track, which explores debates around efforts to protect the nation from terrorism while preserving our values.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Temim Nusraty"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      6,
                      30,
                      "Pm"
                    ],
                    [
                      9,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "ASY",
                  "3219"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH249T",
      "name": "National Security: Domestic Dilemmas",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "The police detain a man thought to be plotting a terrorist attack the next day in a U.S. city that would kill or injure thousands. They want to subject him to \"enhanced interrogation,\" which some consider to be torture. Should the police be permitted to use enhanced interrogation techniques? Who decides? This course will ask key questions raised during the efforts of our national security apparatus to protect the nation. Given the tension between the powers of the government to protect citizens, and the necessary limits on that power, what are the fundamental principles that should govern our efforts to protect the nation while preserving our values? Students will try their hand at finding the delicate balance of these principles in difficult national security dilemmas. This course is self-contained but paired with HNUH249P in the National Security track, which explores post-9/11 policy decisions around the U.S. effort to create a sustainable democracy in Afghanistan.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Daniel Rosenthal"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      7,
                      0,
                      "Pm"
                    ],
                    [
                      9,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "JMZ",
                  "1124"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH258B",
      "name": "The Ecology of Childhood Poverty",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSSP",
        "SCIS"
      ],
      "description": "How does poverty shape the relationship between humans and their environment? It may seem obvious that being poor in childhood has enduring effects on development. What is less obvious is how experiencing poverty in childhood shapes relationships between children and their surroundings, including family interactions, peer relationships, adult dynamics, and the health of the community. Less clear still is the extent to which positive interactions with caretakers and social supports can protect children from potential harm as they grow up. This course focuses on the complexity of poverty as a social force and community concern. Students will investigate the nature of poverty through an interdisciplinary lens that includes social theory, developmental psychology, and empirical studies. After analyzing various approaches to the study of child poverty, students will be in a position to use research on parenting and poverty to evaluate public policy and social programs in their own backyard.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Natasha Cabrera"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "MCB",
                  "1207"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH258U",
      "name": "The Basis of Behavior: Evolution and the Origin of Actions",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSNS"
      ],
      "description": "Why do some monkeys spend time grooming each other in large groups, while others lose their minds with rage if another monkey comes too close? Complex organisms exhibit behaviors that both fascinate and confound, and the way an animal behaves dictates how it interacts with its environment, with profound consequences. Individual behaviors can have dramatic effects on individual fitness, an individual's groupmates, and even the evolution of species. This leads to a fundamental question in behavioral evolution: why do animals do the things they do? The answer lies in the interaction between individual experiences and eons of natural selection. In this seminar, students investigate what organisms were, what they have become, and why. With a focus on the transitions in behavior that caused single cells to evolve over time into complex societies, students will apply evolutionary principles to individual development and explore how and why individuals choose certain behaviors over others.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Riva Riley"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      9,
                      0,
                      "Am"
                    ],
                    [
                      10,
                      15,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "YDH",
                  "0104F"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Riva Riley"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "YDH",
                  "0104F"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH258V",
      "name": "Collective Behavior in Natural and Artificial Systems",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSSP"
      ],
      "description": "From fish schools to traffic jams, natural and artificial systems alike exhibit forms of collective behavior. In fact, the onset of collective behavior in a system of interacting individuals often corresponds to a period of broader transition in the system from a disordered to ordered state. Why do environments as diverse as the ocean and human society follow the same pattern of emergence? The course takes up this question through an exploration of physical and biological systems, such as insects and animal groups, and human crowds; and case studies in transportation, robotics, and social networks. Students will learn to model, analyze, predict, and even synthesize collective networks of all kinds using quantitative methods such as graph theory, dynamical systems theory, agent-based modeling, and data-driven approaches. No prior knowledge of systems theory or methodology is necessary.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Derek Paley"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "0135"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH258W",
      "name": "Migration, Myth, and Memory: Humanity and Hope in the Immigrant Novel",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHU"
      ],
      "description": "Stories of immigrants to the United States reveal the metamorphosis of the nation itself: labor, culture, religion, and politics have all been transformed by diverse waves of new Americans.  Simultaneously, the outlook and traditions of migrants have been profoundly affected by these processes. As a result, both migration and Americanism remain highly contested notions, particularly in light of forced migrations that mark the nation's early history. This course grapples with the complex ways that identity, memory, and culture are made and remade. Moreover, students engage these concepts at the granular level, considering how individual experiences interface with broad historical trends. Through discussions centered on novels about diverse immigrant experiences, students will learn to contextualize problems, re-humanize individuals associated with major social trends and political controversies, and transcend cliches about immigration and American culture through humane interrogation.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Robert Chiles"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      6,
                      0,
                      "Pm"
                    ],
                    [
                      8,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1222"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH259T",
      "name": "Drawn to D.C.: Reading the City",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHU"
      ],
      "description": "A movement known as the Metropolitan Revolution has recognized cities as sites of concentrated economic growth and political power. What does that movement have to do with you? Not only does the city change who you are, but the ambitions and fears that you bring to it also alter what is already there. With Washington, D.C. as a case study, this course considers cities in the context of the ambitious plans that developed them and the unbuilt spaces that open us to imagining them anew. From the ideological tensions and competing policies that politicize urban space, to the construction challenges and social implications of choices made, why we build is as important as what we build. We will experience Washington through its history of spaces, stories, music, art; and learn to see ourselves as co-designers of its present. This course is self-contained but paired with HNUH259P in the Drawn to D.C. track, which explores the created spaces we inhabit, and how they inhabit us.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Ingrid Satelmajer"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1201"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH268B",
      "name": "Global Heritage",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS",
        "SCIS"
      ],
      "description": "What traction does the past have in society today? This course explores globally how the past gains traction in society today and becomes remade in the present. That inquiry will be guided by the idea of heritage, as it mobilizes the past within a broad spectrum of social, political, economic, and environmental issues. We will examine western relationships to the past as intimately tied to property and the drive to plunder, collect, and catalogue. Increasingly, conceptions of heritage include landscapes, as well as intangibles such as music, dance, and folklore. This broad definition honors the diversity of present-day relations to the past, even as it strains heritage management models that are organized around definitions and regulations, and bear the weight of historical injustice. Close examination of heritage at work within global crisis and struggle prompts questions on who owns the past, and who owns up to it. What do we owe the past, and will we be good ancestors to the future?",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Kathryn Lafrenz Samuels"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      10,
                      0,
                      "Am"
                    ],
                    [
                      10,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1119"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      10,
                      0,
                      "Am"
                    ],
                    [
                      10,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1103"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0102",
          "instructors": [
            "Kathryn Lafrenz Samuels"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      10,
                      0,
                      "Am"
                    ],
                    [
                      10,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1119"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      11,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1103"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0103",
          "instructors": [
            "Kathryn Lafrenz Samuels"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      10,
                      0,
                      "Am"
                    ],
                    [
                      10,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1119"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      12,
                      0,
                      "Pm"
                    ],
                    [
                      12,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1103"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH268U",
      "name": "Power, Politics, and the Past: Local Communities and Cultural Heritage",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHU"
      ],
      "description": "The politics of the past surround us. An online memorial to the struggle against the Dakota Pipeline, the call to commemorate Indigeneity instead of Columbus, monuments to the Confederacy torn down... How do diverse communities claim--or reject--particular places, practices, and ideas as their shared heritage, and why? In this course, we will explore these questions with reference to Indigenous communities in global context, with a particular focus on Mexico. Students will engage with theoretical approaches and contemporary case studies to analyze the politics and ethics surrounding the use of the past in diverse Indigenous presents. Visits to DC's museums and archives will help students practice theorizing real-world materials. Students will leave the course with the analytical tools necessary to understand cultural heritage and advocate for Indigenous perspectives on the past. A typical day in this course will involve reading an article-length work and participating in student-led discussion.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Samuel Holley-Kline"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      9,
                      0,
                      "Am"
                    ],
                    [
                      10,
                      15,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "YDH",
                  "0104A"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0102",
          "instructors": [
            "Samuel Holley-Kline"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "YDH",
                  "0104A"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH268V",
      "name": "Art Museums and the Politics of Cultural Heritage",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHU"
      ],
      "description": "Despite the great variety of art museums in the world, these institutions share a common goal: to preserve and interpret cultural consciousness through objects or other material facets of human agency. While these collections often feature the cultural heritage(s) of their lands, in many cases, they also hold objects that have been taken away through illegal or morally questionable practices from their original context. Thus, they prompt discussions about who these holdings really belong to, how they should be displayed and interpreted, and whether they should return to their places of origin. This course explores a number of these issues by asking some fundamental questions: why do art museums matter? How have they evolved over time? What can they become in the future? Students will debate these questions to gain a finer understanding of the complex role of these institutions as custodians of cultural heritage.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Aneta Georgievska-Shine"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "ASY",
                  "3217"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH278B",
      "name": "Democratic Habits",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHU",
        "SCIS"
      ],
      "description": "How do ordinary citizens power democracy? At the age of 18, every American citizen is endowed with the right to vote, but what if democracy demands more than voting?  With democratic processes seemingly in peril all around us, what can and should ordinary citizens do to safeguard democracy? Looking beyond the basic right to vote, this class will instead explore the complex ecosystem of citizenship practices necessary for collective self-governance. Turning to both philosophy and history, the course material addresses the power and peril of such civic habits as mutual aid, economic participation, tolerance, attention, organizing, protest, and more. We consider what resources these habits require, what virtues they inspire, and what happens when they conflict with each other. Students in this course will acquire the tools to develop and act on their own answer to the pressing question of what it will take to save democracy.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Kristjana Maddux"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "KEY",
                  "0106"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH278U",
      "name": "Indigenous Knowledge, Supernatural Remedy, and Collective Action: Lessons from Agrarian Societies",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS"
      ],
      "description": "How were human communities sustained before the rise of capitalism, individualism, and secularism? Where can we look to imagine a world in which modern science, polity, and ethics are not the defining system of civil social? Through an exploration of stories from late medieval Europe, China, Southeast Asia, and other regional communities, with a particular focus on the East, this course aims at de-orientalizing the narratives of the Western world by recovering the collective practices of the global past and present. Interrogating the idea that human history has been a linear process of industrialization and secularization, this course encourages students to reflect on the limits and problems of modernization, and learn from cultures whose practices were displaced or silenced by colonial knowledge production. Students will be empowered to consider, and even envision, alternative versions of modernity and the future of our world.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Yupeng Jiao"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "YDH",
                  "0104F"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Yupeng Jiao"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "YDH",
                  "0104F"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH278V",
      "name": "Climate Change, Infectious Disease, and Civil Society",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Viruses that are lethal to human life have been on earth for centuries. Why are they surging now? And how can we respond to the recent breakneck spread of Coronavirus? This class begins its journey with Homo sapiens, our ancestor that dispersed out of Africa and carried infectious diseases across the planet. Human expansion into new ecosystems also provided opportunities for us to acquire new pathogens. While all of human history is marked by diseases caused by human migration, the Industrial Revolution greatly accelerated human mobility while planting the seeds of the human impact on climate change. Today, the increasingly rapid movement of people and goods, combined with a warming planet and the large-scale disruption of major ecosystems has witnessed an unprecedented spread of infectious diseases. Students will explore how these trends impact our lives and collectively challenge themselves to do what must be done to save our planet and ourselves.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Jonathan Dinman"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "MCB",
                  "1123"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH288B",
      "name": "Race, Reproduction and Rights",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS",
        "SCIS"
      ],
      "description": "Can humanity thrive without ensuring reproductive freedom? The 2022 US Supreme Court decision that the right to an abortion is unconstitutional has generated impassioned debate about women's rights and access to reproductive health care in the US and globally. This debate opens space to think beyond \"pro-choice or pro-life\" polarization and create conditions that promote equity, respect for rights, and a healthy society. These conditions would need to address injustices such as the racism, gender inequalities, marginalization, and colonization that produce disparities in reproductive health care and jeopardize the well-being of individuals, families, communities, and countries. Who controls the bodies of marginalized women and men? What is the meaning of reproductive rights for people who have little power? This course challenges students to bring together multiple disciplines, become critical data consumers, and develop innovative ways to use this knowledge to influence policy.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Sangeetha Madhavan"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "ATL",
                  "2400"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH288U",
      "name": "The Body Knows: Creating Healthy Intimacy on College Campuses",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "How do we figure out what we physically desire? How do we know where our boundaries are and how do we communicate that to others? What would it look like to create a campus community where young people are confident about their sexuality and their ability to communicate the nuances of their needs to potential partners? This course is designed as a creative workshop to help students put their own embodied knowledge in conversation with theories and practices of healthy intimacy. Core texts explore the history of sexual violence as a tool of colonization, the relationship between feminism and sex-positivity in popular culture, and the consent theories that have become central to college campus responses to sexual violence. With the help of performance-based techniques, students will have the opportunity to research issues specific to UMD, design curricula for their peers, and advocate for an end to sexual violence on campus.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Katherine Lieder"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "PKT",
                  "2102"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Katherine Lieder"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "PKT",
                  "2102"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH288V",
      "name": "Campus Well-being: Solving the Health Inequity Puzzle",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "The last few years have highlighted the need to focus greater effort on health and well-being, and the challenge of doing it equitably. College campuses, in particular, have made student care and equitable access a priority. Yet, the data suggest that we are still not succeeding across the board. This seminar takes the current student body at UMD as its case study to understand the range of factors that contribute to well-being and health disparities. Students will review reports and relevant literature about the most recent campus surveys: the University New Student Census, Withdrawal Survey, the Food Access &amp; Student Well-being Study, and surveys completed by Counseling Center clients. They will apply the study findings to their everyday lives, formulate evidence-based recommendations regarding student programs/services, brainstorm questions to be included in future campus surveys, and test ways to use research to promote positive change for all.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Yu-Wei Wang"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "HJP",
                  "2217"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH300",
      "name": "Vantage Point Seminar",
      "credits": {
        "Amount": 2
      },
      "gen_eds": null,
      "description": "Goal-setting and project-design seminar required of all UH students and taken in the second semester of the sophomore year or the first semester of the junior year.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Ingrid Satelmajer",
            "Christine Jones"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      9,
                      0,
                      "Am"
                    ],
                    [
                      9,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1222"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Ingrid Satelmajer"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      10,
                      0,
                      "Am"
                    ],
                    [
                      10,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1222"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0301",
          "instructors": [
            "Robert Graham"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      11,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "KNI",
                  "1206"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0401",
          "instructors": [
            "Riva Riley"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      2,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "ATL",
                  "2316"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0501",
          "instructors": [
            "Samuel Holley-Kline"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      3,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "HBK",
                  "0108"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0601",
          "instructors": [
            "Ingrid Satelmajer",
            "Daniel Zipp"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      4,
                      0,
                      "Pm"
                    ],
                    [
                      4,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1221"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0701",
          "instructors": [
            "Ingrid Satelmajer",
            "Jordan Johnson"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      11,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "KNI",
                  "1103"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0801",
          "instructors": [
            "Ingrid Satelmajer",
            "Rebecca Jones"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      10,
                      0,
                      "Am"
                    ],
                    [
                      10,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1221"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0901",
          "instructors": [
            "Alexandra Harlig"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      11,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "BPS",
                  "1232"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "1001",
          "instructors": [
            "Yupeng Jiao"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      2,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "HBK",
                  "0125"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "1101",
          "instructors": [
            "Ingrid Satelmajer",
            "Brynne McBryde"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      3,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "JMZ",
                  "2123"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "1201",
          "instructors": [
            "Katherine Lieder"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      4,
                      0,
                      "Pm"
                    ],
                    [
                      4,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "JMZ",
                  "2123"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "HNUH398P",
      "name": "Federal and Global Experiential Learning",
      "credits": {
        "Range": [
          3,
          9
        ]
      },
      "gen_eds": [
        "DSSP"
      ],
      "description": "This is the experiential course component of the Federal Fellows Program and Global Fellows Program.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Joan Burton",
            "Jayakumar Arasan"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      6,
                      30,
                      "Pm"
                    ],
                    [
                      7,
                      40,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "ESJ",
                  "1202"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Joan Burton",
            "Jayakumar Arasan"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      6,
                      30,
                      "Pm"
                    ],
                    [
                      7,
                      40,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "ESJ",
                  "1202"
                ]
              }
            }
          ]
        }
      ]
    }
  ]
}