{
  "name": "MLSC",
  "courses": [
    {
      "code": "MLSC250",
      "name": "Lol that's not funny: Language change and linguistic creativity in online communication",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHU"
      ],
      "description": "Recent developments in technology, from texting to Zoom, have created new environments for human language use. Examining how communication is changing in these environments highlights humans' endless linguistic ingenuity -- ranging from new vocabulary and punctuation conventions to the use of hashtags, emoji and memes. At the same time, these linguistic innovations exemplify broader patterns of language change and diversity that have been documented and studied by language scientists. In this course, we will engage with the study of language variation and change through a survey of language use in different online environments, and will apply insights from linguistic research to analyze our own and others' language use in more nuanced ways.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Emily Lord"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "HJP",
                  "2123"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "MLSC308",
      "name": "PULSAR Language Science Research Seminar",
      "credits": {
        "Amount": 1
      },
      "gen_eds": null,
      "description": "Restriction: Must be in PULSAR program or have permission of the instructor.  Repeatable to 4 credits.  Credit only granted for: BSOS338P or MLSC308.  Formerly: BSOS388P.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Andrea Zukowski"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        }
      ]
    }
  ]
}