{
  "name": "ISRL",
  "courses": [
    {
      "code": "ISRL329P",
      "name": "Special Topics in Israel Studies; Israeli Foreign and Security Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Cross-listed with GVPT368E. Credit only granted for ISRL329P or GVPT368E. This course will provide an overview of Israeli foreign and security policy from 1948 to the present. We will examine how Israel's foreign and security policies reflect its Jewish origins, Zionist ideology, its relations with its neighbors and world powers, and its regional quest for recognition and legitimacy.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Ilai Saltzman"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1101"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ISRL329Y",
      "name": "Special Topics in Israel Studies; Israel in Regional, International, and U.S. Media and Social Media",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Cross-listed with JOUR459Y. Credit only granted for ISRL329Y or JOUR459Y.<br><br> This course offers a comprehensive exploration of the multifaceted relationship between Israel and the media landscape in the regional, international, and U.S. media landscapes, providing students with the tools to critically analyze and understand the complex narratives on Israel, Arab-Israeli, Israeli-Palestinian affairs and the dynamics at play. Students will delve into the historical, cultural, and political context that shapes the portrayal of Israel in traditional media outlets, as well as the transformative power of social media platforms.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Marwa Maziad"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "TuTh": [
                  [
                    12,
                    30,
                    "Pm"
                  ],
                  [
                    1,
                    45,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ISRL329Z",
      "name": "Special Topics in Israel Studies; Blackness in Israeli Popular Culture and Contemporary Art",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Cross-listed with AASP398F and SOCY398Z. Credit only granted for ISRL329Z, AASP398F, or SOCY398Z.<br><br> This course will review the work of artists of Ethiopian origin who are active in the Israeli art field today and analyze the subjects they deal with in their work in relation to the socio-political change in Israel and the increase in Ethiopian representation in popular culture. We will discuss concepts such as socio-political art, activism through art, and a-political art.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Efrat Yerday"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "HBK",
                  "0105"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ISRL342",
      "name": "History of Modern Israel",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS"
      ],
      "description": "History of modern Israel since the beginning of the Zionist settlement in 1882. Attention to different interpretations and narratives of Israel's history, including the historical and ideological roots of Zionism, the establishment of the State of Israel, ideological forces, wars, and the triumphs and crises of democracy.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Paul Scham"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1117"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ISRL349N",
      "name": "Investigating Topics in Israel Studies; The Arabs in Israel: Palestinian Arab Citizens of Israel",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Cross-listed with GVPT368J. Credit only granted for ISRL349N or GVPT368J.<br><br> This course examines the political, social, and economic experience of the Arab minority in Israel from the establishment of the State up until recent years. It addresses the relationship between the State and the Arab community and the distinctive internal dynamics of Arab society as well as the relationship between the Arab minority in Israel and the Palestinians, and the Arab world.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Morad Elsana"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      6,
                      0,
                      "Pm"
                    ],
                    [
                      8,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "KEY",
                  "0126"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ISRL349O",
      "name": "Investigating Topics in Israel Studies; American Jewry, Israel, and U.S. Public Policy: Peoplehood, Politics, and Power",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Cross-listed with GVPT368N. Credit only granted for ISRL349O or GVPT368N.<br><br> The Jewish people have long maintained a unique sense of peoplehood, which for much of Jewish history coincided with powerlessness and political marginalization. The modern American Jewish experience has been unique in Jewish history largely due to the opportunity structure afforded by the American political system; and power, specifically the American Jewish community s ability to adapt and participate in the policy arena to maximize its preferred outcomes. This upper-division course examines these features of American Jewry and its relationship with Israel in therealm of US public policy by focusing on historical development and Jewish political thought; organizational and representative structures; and highlighting several case studies and thematic topics.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Scott Lasensky"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      5,
                      0,
                      "Pm"
                    ],
                    [
                      7,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "KEY",
                  "0126"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ISRL349W",
      "name": "Investigating Topics in Israel Studies; Israeli Slang",
      "credits": {
        "Range": [
          3,
          6
        ]
      },
      "gen_eds": null,
      "description": "Cross-listed with HEBR398W and JWST319W. Credit only granted for HEBR398W, ISRL349W, or JWST319W.<br><br> Examination of the history, linguistics, politics and sociology of Modern Israeli Hebrew slang, including influences from popular American culture, technology, the military, Arabic and immigrant group languages. Taught in English; course materials in Hebrew with translation.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Avital Karpman"
          ],
          "class_meetings": [
            "OnlineAsync"
          ]
        }
      ]
    },
    {
      "code": "ISRL349Y",
      "name": "Investigating Topics in Israel Studies; Environment and Sustainable Development in Israel",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Cross-listed with GVPT368K. Credit only granted for ISRL349Y or GVPT368K.<br><br> Relationships between the environment and different communities that share it, specifically in and around Israel, given the negative effects of climate change and environmental degradation throughout the Middle East. We will examine the ecological and environmental challenges Israel has faced over the years, the many innovative ways in which it has worked to overcome these challenges, and the tasks that still lie ahead. Finally, we will look at the nexus between sustainable development and sustainable peace within and between diverse communities.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Instructor: TBA"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "Th": [
                  [
                    5,
                    0,
                    "Pm"
                  ],
                  [
                    7,
                    30,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ISRL350",
      "name": "The End of the Israel-Arab Conflict??",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS"
      ],
      "description": "Violence between Jews/Israelis and Arabs/Palestinians on both an inter-communal and inter-state level has been pervasive in the Holy Land for over a century.  However, in the past few years, Israel has signed treaties with several Arab countries and more are likely in the near future.  Is the larger Israel-Arab conflict ended, or nearly so? This course will examine the last 30 years to understand what has changed about these conflicts and what remains, and then explore different scenarios as to how peace may be possible and what it might look like.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Paul Scham"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TWS",
                  "0205"
                ]
              }
            }
          ]
        }
      ]
    }
  ]
}