{
  "name": "PLCY",
  "courses": [
    {
      "code": "PLCY100",
      "name": "Foundations of Public Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS"
      ],
      "description": "A survey course, focusing on public policy institutions and analytical issues as well as on overview of key public policy problems. Students will be introduced to public policy as a discipline, with a brief overview of the actors and institutions involved in the process, and familiarize themselves with the kinds of problems typically requiring public action. The course will examine these problems from a multijurisdictional and multisectoral perspective. Specific policy areas examined include education policy, health policy, economic and budgetary policy, criminal justice policy, environmental policy, and national and homeland security policy. The course should permit students to have broad foundational exposure to the field that will give them a solid base for more advanced courses.",
      "sections": [
        {
          "sec_code": "0201",
          "instructors": [
            "Toby Egan"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      1,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0301"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      11,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0102"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0202",
          "instructors": [
            "Toby Egan"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      1,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0301"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      12,
                      0,
                      "Pm"
                    ],
                    [
                      12,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TLF",
                  "1101"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0203",
          "instructors": [
            "Toby Egan"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      1,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0301"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      1,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0225"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0204",
          "instructors": [
            "Toby Egan"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      1,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0301"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      10,
                      0,
                      "Am"
                    ],
                    [
                      10,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0102"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0205",
          "instructors": [
            "Toby Egan"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      1,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0301"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      1,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0102"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY101",
      "name": "Great Thinkers on Public Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS",
        "SCIS"
      ],
      "description": "Great ideas in public policy, such as equality, efficiency, sovereignty, liberty, bureaucracy, democracy and security are explored through the lens of great thinkers. An introduction to the intellectual foundations of public policy, from ancient theories on collective public action through the more contemporary development of public policy as a discipline. This may start as early as the ancient Greek philosophers and their views on public action through contemporary classics of public policy. At the conclusion of the course, students will have read classic works in the field and will master the key themes that have dominated the intellectual debates about public policy over its history. Emphasis will be on the interdisciplinary foundations of public policy, through examining core disciplinary contributions from economics, political science, management, philosophy, and other relevant disciplines.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Philip Joyce"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      12,
                      30,
                      "Pm"
                    ],
                    [
                      1,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "ESJ",
                  "1202"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY201",
      "name": "Public Leaders and Active Citizens",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS",
        "DSSP",
        "SCIS"
      ],
      "description": "Aims to inspire, teach and engage students in the theory and practice of public leadership from the local to the national to the global level. Students will learn and apply diverse approaches to leadership in a multicultural society while developing an understanding of key frameworks and practices necessary to foster collective action across private, public, and nonprofit sectors. This course will allow students to become informed citizens able to reason critically and persuasively about public matters Students will also explore and assess their own personal values, beliefs, and purpose as they develop their leadership potential.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Cullen Merritt"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      12,
                      30,
                      "Pm"
                    ],
                    [
                      1,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "CCC",
                  "1205"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Brandi Slaughter"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0102"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0301",
          "instructors": [
            "Nancy Lineman"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      5,
                      0,
                      "Pm"
                    ],
                    [
                      7,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "KEY",
                  "0103"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY203",
      "name": "Liberty and Justice for All: Ethics and Moral Issues in Public Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Students will broaden their understanding of the moral dimensions of public policy as well as their own individual moral perspective. Discussions will include the ideal of a just society, and the place of liberty and equality in it, while focusing on contemporary theories of ethics and justice.  It will develop students' appreciation of the ethical challenges unique to the public service sector while building their skills in ethical analysis and decision-making. We will explore the increasing ethical challenges in a world in which technology, global risks, and societal developments are accelerating faster than our understanding can keep pace. A framework for ethical decision-making underpins the course.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Jennifer Littlefield"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SKN",
                  "0104"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY213",
      "name": "Foundations of Nonprofit Leadership and Social Innovation",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Through discussions of contemporary trends, challenges and issues, this course provides an introduction to the nonprofit and NGO sectors, social innovation, and the leadership and management skills required to achieve social impact. The course will explore the history, theories, and roles of philanthropy, the nonprofit sector, and social innovation in societies and cultures. Students will be able to demonstrate an understanding of the process and principles of social entrepreneurship and social innovation. Additionally, the course will introduce students to topics in leadership, social innovation, resource development, community mobilization through networks, the role of policy-making in creating change, project management, and overall strategies for achieving social impact. The course will include mini hands-on learning experiences that allow them to apply key learning outcomes.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Selvon Waldron"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      6,
                      0,
                      "Pm"
                    ],
                    [
                      8,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1105"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "James Stillwell"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1105"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY215",
      "name": "Innovation and Social Change: Creating Change for Good",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSSP"
      ],
      "description": "A team-based, highly interactive and dynamic course that provides an opportunity for students to generate solutions to a wide range of problems facing many communities today.  Students in the iGIVE Program will deepen their understanding of entrepreneurship and innovation practices by creating and implementing projects or ventures that address an issue of their choosing while learning topics such as communications, project management, teamwork, leadership, fundraising, project sustainability and next steps in social change.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Patricia Bory"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "ESJ",
                  "2101"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY240",
      "name": "Ethical, Policy and Social Implications of Science and Technology",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSSP",
        "SCIS"
      ],
      "description": "Asks students to think about how society should manage complexity, transformation, and uncertainty with an eye on developing a broader sense of ethics and social responsibility. Introduces analytical frameworks, concepts, and data collection techniques that interdisciplinary scholars use to map relationships among science, technology and society and generate important questions about the future of society.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Timothy Reedy"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      12,
                      30,
                      "Pm"
                    ],
                    [
                      1,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "HJP",
                  "2242"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY288A",
      "name": "Introduction to Public Policy Topics; 21st Century Racial Justice and Gender from the Bullhorn to the Ballot",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "The intersection of gender and racial justice movements of the past two decades. Students will examine the representation and complication of gender within police reform, voting rights and environmental justice movements, among others. Particular attention will be given to the role gender has played as these issues and related policies have evolved in the modern era.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Charly Carter"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      1,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0225"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY288F",
      "name": "Introduction to Public Policy Topics; The Contested Terrain of Education Policy: The Fight for Educational Equity",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Provides an introduction to K-12 education policy, policy processes, and school governance in the United States. We will examine the multiple and sometimes conflicting goals that animate education debates and the various lenses and conceptual tools that can help us understand the contested terrain of education policy. In this course, students learn the vari ous ways policies and educational systems fight or perpetuate education inequity. The course will emphasize a critical analysis of these educat ional inequities and the different policy solutions that have been implemented to respond to these inequities. We will analyze and understand the diverse approaches to solving education challenges and their impact onmarginalized communities. Using role-play with classmates and professionals, students will explore real case studies and challenges in K-12 education policy.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Curtis Valentine"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      6,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "JMZ",
                  "2122"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY288J",
      "name": "Introduction to Public Policy Topics; America Abroad:Debating US Foreign Policy Yesterday and Today",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Examines historical and conceptual debates over the United States of America s role in international affairs in order to assess contemporary concerns surrounding American foreign policy. Topics covered include therole of alliances, ideology/democracy promotion, military power, and foreign intervention in creating a safe and secure world in which the United States can operate. By engaging both primary and secondary sources, students will emerge from the course able to apply historical evidence and theory to contemporary discussions, thus allowing them to directly contribute to US foreign policy debates today.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Joshua Itzkowitz Shifrinson"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "PLS",
                  "1117"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY288W",
      "name": "Introduction to Public Policy Topics; Global Action and Problem Solving",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Today's most pressing problems do not stop at national borders. Meeting these challenges requires a range of state and non-state actors to work together. In this course, students gain familiarity with key actors in the global system and how they approach today's most intractable problems, including violent conflict, human rights, non-proliferation of weapons of mass destruction, migration, trade, climate change, and global health. How do countries, international organizations, multinational corporations, and nongovernmental organizations find ways to cooperate when their interests and capabilities sometimes differ drastically? What barriers exist that impede such cooperation? This course can be taken as a stand-alone class for those interested in issues of global cooperation and problem solving and will also prepare students in the GAPS focus area for more advanced electives.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Devin Entrikin"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "JMZ",
                  "0205"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY300",
      "name": "Governance: Collective Action in the Public Interest",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Examination of societal responses to public problems, including actions by government, non-profit and private sector actors, as well as civil society. Students will examine the roles of these various actors, as well as the nature of civic responsibility. The course will examine the various stages of the policy process, asking the following questions: How does something get defined as a problem that requires a public policy response? How do we think about what the options are for this response, and how do we choose among them? What are the factors that contribute to successful policy implementation? How do we evaluate the success of public policies? These questionswill be addressed using examples of current public policy problems, and students will be expected to engage in individual and collaborative work to design responses to those problems.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Joannie Tremblay-Boire"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0225"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Joannie Tremblay-Boire"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      12,
                      30,
                      "Pm"
                    ],
                    [
                      1,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0225"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY301",
      "name": "Sustainability",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Designed for students whose academic majors would be enhanced by the complementary study of a widely shared but hard-to-operationalize aspiration: that present choices should preserve or improve future options rather than foreclose or degrade them. How should we understand sustainability? How might we achieve it? How would we know if we had achieved it? And how could sustainability activists of a rising generation lead by example?",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Matthew Regan"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0301"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY302",
      "name": "Examining Pluralism in Public Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DVCC"
      ],
      "description": "Understanding pluralism and how groups and individuals coexist in society is an essential part of the public policy process. This course will examine the ways in which the diverse experiences of race, gender, ethnicity, class, orientation, identity, and religion impact the understanding of and equitable delivery of public policy. The examination of how identity development shapes our understanding of society and influences the decision-making process is central to students' shaping policy that is truly for the people. This course will equip students with the skills needed to analyze pluralism and draw conclusions about the application of various theories to public policy issues.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Alana Hackshaw"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0225"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Alana Hackshaw"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0225"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0301",
          "instructors": [
            "Toby Egan"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "PLS",
                  "1119"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY303",
      "name": "Public Economics Raising and Spending the People's Money",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Applied course in public finance, including introductions to resource mobilization (including taxation), macroeconomic policy, key public expenditure policies, and government budgetary processes and politics. The course will build on the foundations from ECON 202 to address the specific application of public finance principles to solving public problems. The course will focus on the principles of welfare economics (including market failure), economic principles as applied to particular spending programs and tax choices, and issues and institutions involved in the allocation and management of resources both at a national and subnational level. The focus of the course is on these issues from both a domestic and global perspective.",
      "sections": [
        {
          "sec_code": "0201",
          "instructors": [
            "Juan Martinez Guzman"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MWF": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      11,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0225"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY304",
      "name": "Evaluating Evidence: Finding Truth in Numbers",
      "credits": {
        "Amount": 4
      },
      "gen_eds": null,
      "description": "Enables students to understand the research done by others with a sufficiently skeptical eye to allow them to determine whether the findings of the research are valid given the assumptions made and methods used. This will involve, in part, thinking about the various problems in research design or conduct that could lead to faulty conclusions. It will also involve being able to differentiate between credible sources of information and those that are not objective. At the conclusion of the course, students should be able to differentiate objective evidence from political argumentation.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Michael Busse"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TYD",
                  "0111"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      3,
                      0,
                      "Pm"
                    ],
                    [
                      4,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TYD",
                  "0111"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY306",
      "name": "Public Policy Analysis in Action",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Utilizes our unique location in the Washington, D.C. region to create a laboratory within which to analyze local, regional, national and international policy problems. Students will be put into teams and assigned to real and timely policy cases. The course will include meetings and field trips with local leaders in the field, ideally connected to the cases. Student will then expand and apply their use of policy analysis and evaluation skills to define those problems, analyze alternative responses, devise appropriate strategies for implementation, and evaluate the success of the proposed policy and implementation. The course will conclude with team presentations to local leaders and faculty. This distinctive course will serve to prepare students for their client- based senior capstone course.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Niambi Carter"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "2166"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY309",
      "name": "Internship in Political Institutions: State and Local",
      "credits": {
        "Range": [
          3,
          6
        ]
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Martin Sanders"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        }
      ]
    },
    {
      "code": "PLCY310",
      "name": "Nonprofit Leadership and Social Innovation in Action",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Furthers students understanding of topics in leadership, social innovation, resource development, community mobilization through networks, and the role of policy making in creating change. This course will further students understanding of the creation and leadership of nonprofits, social ventures, governance and boards; strategic planning and partnerships; advocacy and public policy processes; community outreach; working in teams, effective communications, and cross-sector approaches to scaling up social impact.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Leslie Jefferson"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      3,
                      0,
                      "Pm"
                    ],
                    [
                      5,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TWS",
                  "0236"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY313",
      "name": "Advocacy in the American Political System",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Introduces students to the creation of law through the legislative process with a special focus on the Maryland General Assembly.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Gerard Evans"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      4,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0301"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY380",
      "name": "Innovation and Social Change: Do Good Now",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSSP",
        "SCIS"
      ],
      "description": "Introduces students to the concept of social innovation while exploring the many mechanisms for achieving social impact. It is team-based, highly interactive and dynamic, and provides an opportunity for students to generate solutions to a wide range of problems facing many communities today. Deepens the students understanding of entrepreneurship and innovation practices by guiding them through the creation and implementation process as applied to a project idea of their choice.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Katlin Gray"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "HBK",
                  "0115"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Joannie Tremblay-Boire"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      6,
                      0,
                      "Pm"
                    ],
                    [
                      8,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "HJP",
                  "2217"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY388A",
      "name": "Special Topics in Public Policy; Child and Family Policy Impact",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Cross-listed with FMSC498P. Credit only granted for PLCY388A or FMSC498P.<br><br> For poor and low-income families, federal programs such as Medicaid, Child care, SNAP and child nutrition programs are a lifeline every day. Some programs also have policies that consider more than income eligibility, such as number of hours of work, disability, and immigration status. Budget choices have a significant impact on policy intentions. Students will learn about and analyze the major federal programs and federal budgets for these policy areas; understand from data the impact of such programs and policies; and be introduced to significant advocacy effortsand considerations that shaped these policy decisions.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Brandi Slaughter"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0225"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY388C",
      "name": "Special Topics in Public Policy; Fundamentals of Cybersecurity for Policy Makers",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Jointly offered with INST467. Credit only granted for PLCY388C or INST467. Students will explore the key issues facing policy makers attempting to manage the problem of cybersecurity from its technical foundationsto domestic and international policy considerations surrounding governance, privacy, risk management, and operational orchestration. It is designed for students with no background in information technology, and will provide the principles to understand the current debates shaping a rapidly evolving security landscape.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Charles Harry"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "CHE",
                  "2136"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY388F",
      "name": "Special Topics in Public Policy; Contemporary Issues Under the Rule of Law",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Considers the impact of contemporary issues and public policy of the Courts through the examination of current issues under deliberation. Students will evaluate and opine on the competing legal and policy arguments in class and in papers as if they were the empowered judicial authority. Issues covered include: the growth of opinion-based news reporting versus factual news, \"Fake news,\" and freedom of the press; voter photo ID laws, redistricting and political gerrymandering; continued racial segregation; holding public officials accountable for egregious constitutional violations; regulation of social media; and socioeconomicinequality. The course also provides a broad overview of the ways American courts function as well as interactive speakers and hands on experiences.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Mariana Cordier"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      5,
                      0,
                      "Pm"
                    ],
                    [
                      7,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "JMZ",
                  "0120"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY388G",
      "name": "Special Topics in Public Policy; Cracking the Code: AI, Race, Gender &amp; Policy Innovation for a 21st Century World",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Explores the interplay between race, gender, science, technology, and public policy. In an era where science and technologies increasingly impact various aspects of society, it is crucial to understand how these fields can reinforce or mitigate existing disparities related to race and gender. Drawing from diverse disciplines that include politics,science,and ethics, students will explore how these interconnected fields are shaped by our society, institutions, and policymaking processes. Through critical examination, students will analyze ethical, social, and policy dimensions of science and technological development.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Rexanah Wyse Morrissette"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      5,
                      0,
                      "Pm"
                    ],
                    [
                      7,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TYD",
                  "1102"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY388R",
      "name": "Special Topics in Public Policy; Nuclear Security Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Students are introduced to major themes and debates in the contemporary study of nuclear security, from historical, theoretical, practical, and international perspectives. This course will provide students with the technical and conceptual tools needed to understand the role nuclear weapons play in international politics. It will include a historical overview of the nuclear age, including a discussion on the evolution of nuclear strategy and the introduction of a new nuclear lexicon, the global nuclear arms race, and the development of the international nuclear nonproliferation regime. The course will cover a wide range of contemporary nuclear challenges, including nuclear security/terrorism, non-state actor nuclear challenges, international momentum behind nuclear disarmament (particularly, the evolution of the Treaty on the Prohibition of Nuclear Weapons), and the role of nuclear weapons in international politics, paying particular attention to future U.S.-Russia/U.S.-China relations, and India-Pakistan-China relations.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Gregory Ramsay"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1101"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY399B",
      "name": "Directed Study in Public Policy; Policy Ambassadors",
      "credits": {
        "Amount": 1
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Beatrice DeBelen"
          ],
          "class_meetings": [
            "Unspecified",
            "OnlineAsync"
          ]
        }
      ]
    },
    {
      "code": "PLCY399T",
      "name": "Directed Study in Public Policy; Undergraduate Teaching Assistant",
      "credits": {
        "Range": [
          1,
          3
        ]
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Jennifer Littlefield"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        }
      ]
    },
    {
      "code": "PLCY400",
      "name": "Senior Capstone",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Public Policy students will take the skills and knowledge gained through their curriculum and apply them through their senior capstone course.  Students will work in teams on problems and issues presented by outside clients, with guidance from faculty facilitators and interaction with the clients.  Each team will work with the client to address a particular problem and produce a mutually agreed upon outcome.  These hands on projects will advance students' understanding of the analytical, leadership, communication and problem solving skills necessary to address today's policy problems while allowing them to gain professional level experience that could contribute to their success in their post UMD endeavors.  The course will conclude with an event that allows all teams to present their findings and outcomes to their client while being evaluated by faculty and public policy professionals.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "PATRINA CLARK"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      5,
                      0,
                      "Pm"
                    ],
                    [
                      7,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TLF",
                  "0110"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Martin Sanders"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      6,
                      0,
                      "Pm"
                    ],
                    [
                      8,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "JMZ",
                  "0205"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0301",
          "instructors": [
            "Paul Brown"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      6,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0102"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY401",
      "name": "Contemporary Issues in Public Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "An integrative course that allows policy students to explore the complexities of the policy-making process from the perspective of specific policy topics. They will learn about and discuss subject- based issues in a seminar format led by faculty and policy experts. Site visits to federal agencies, guest speakers, and round table sessions ensure that students receive a variety of real-world perspectives on their chosen policy area.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Tracy Thompson"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      5,
                      0,
                      "Pm"
                    ],
                    [
                      6,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "MMH",
                  "1304"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Catherine Worsnop"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "JMZ",
                  "0103"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0401",
          "instructors": [
            "Margaret Brindle"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      12,
                      30,
                      "Pm"
                    ],
                    [
                      1,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "PLS",
                  "1158"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY488A",
      "name": "Advanced Special Topics in Public Policy; Design and Democracy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Cross-listed with ARTT489J and GVPT368O.  Credit only granted for ARTT489J, GVPT368O, or PLCY488A.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Instructor: TBA"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      3,
                      0,
                      "Pm"
                    ],
                    [
                      5,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "ASY",
                  "2322"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY610",
      "name": "Quantitative Aspects of Public Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Introduces statistical methods needed for evaluating and choosing among policy options. Topics include probability; decision-making under uncertainty; the organization, interpretation, and visual display of complex data; prediction and inferences about causality; hypothesis testing; and linear and multiple regression. Develops analytical skills and the ability to apply theory to complex, real-world problems.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Michael Busse"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      7,
                      0,
                      "Pm"
                    ],
                    [
                      9,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TYD",
                  "1114"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY630",
      "name": "Normative and Political Dimensions of Public Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Explores the normative and political dimensions of governance--or policymaking--at the domestic (focusing on the US) and global levels. Policymaking involves a myriad of public and private actors at the local, national, transnational, and global levels that have competing aims and values. Their interaction produces formal and informal policies that affect the international order, interstate relations, subnational dynamics, and individuals. Drawing on theory from multiple disciplines and case examples, the course examines governance at these interrelated levels. Students learn core concepts, debates, and actors involved in policy making, develop tools to identify the causes and consequences of different policies, and build skills to influence public governance. Students also critically analyze how the actors, institutions, and scholarship covered perpetuate systemic racism and other inequities based on gender, class, ethnicity, sexual orientation, religion, dis/ability, etc.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "John Ronquillo"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      4,
                      15,
                      "Pm"
                    ],
                    [
                      6,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "WDS",
                  "0104"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY631",
      "name": "Governance: Leadership, Management and Accountability",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Emphasizes that regardless of technical specialization, public policy practitioners are required to lead people and organizations, manage resources and processes, and be held accountable for their actions. Provides knowledge, insights, skills, and abilities to successfully participate in and contribute to the policy process and lead and manage in line with democratic norms and values. Shows the need to pursue efficiency, effectiveness, and speed while also prioritizing justice, equity, procedural fairness, and due process. Focuses on the \"people\" side of organizational life, ethical decision-making, and the ability to communicate effectively.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Elizabeth Duke"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      4,
                      15,
                      "Pm"
                    ],
                    [
                      6,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0102"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Elizabeth Duke"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      9,
                      15,
                      "Am"
                    ],
                    [
                      11,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0102"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY640",
      "name": "Microeconomic and Policy Analysis",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Applies intermediate microeconomic theory to public policy issues: resource allocation by firms and consumers; the response of economic agents to changes in incentives; market allocations in competitive and non-competitive environments; and market failures and government remedies. Uses extended case studies of particular issues in such areas as the environment (acid rain), international trade (tariffs), industry regulation (cable TV), and the provision of public goods (highways).",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Thomas Spreen"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      4,
                      15,
                      "Pm"
                    ],
                    [
                      6,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "JMZ",
                  "2207"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY641",
      "name": "Macroeconomics and Policy Analysis",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Studies the behavior of the economy as a whole: the level of national income, unemployment, and inflation; the vulnerability of the U.S. economy to external influences; possible federal influence over the level of economic activity; and the consequences for prices, employment and the U.S. trade deficit. Also examines possible U.S. policy responses to widespread debt crises in developing countries.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "John Green"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      1,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "HBK",
                  "0125"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY670",
      "name": "Public Budgeting &amp; Financial Management",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Covers how governments raise, spend, borrow, and manage public funds. Reviews federal,state, and local budget processes and introduces analytical techniques including basic spreadsheet skills, evaluating alternative revenue sources, revenue and expenditure forecasting, cost allocation, capital budgeting, cost-benefit analysis, discounting and present value, bond analysis, cash management and intergovernmental finance.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Juan Martinez Guzman"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      1,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "KEY",
                  "0102"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Philip Joyce"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "W": [
                  [
                    7,
                    0,
                    "Pm"
                  ],
                  [
                    9,
                    30,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY680",
      "name": "Examining Social Identity and Pluralism in Public Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Understanding how groups and individuals develop and coexist in society is an essential part of public policy. Using the classroom as a laboratory, students will explore identity development and how the intersections of race, class, gender, sexual orientation, and other identities shape perceptions that inform decision-making and policy development. From historical scholars to current day movement leaders, this course equips students with tools necessary to critically analyze pluralism, power, and identity; and the skills needed to shape meaningful and equitable public policy and working and civic environments for all.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Patricia Bory"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      4,
                      15,
                      "Pm"
                    ],
                    [
                      6,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "ESJ",
                  "1309"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY688B",
      "name": "Topics in Public Policy; Economics of Education",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Restriction: Must be in a major in PLCY-School of Public Policy; or permission of PLCY-School of Public Policy. Cross-listed with TLPL670. Credit only granted for TLPL670 or PLCY688B.<br><br> An introduction to the application of economic principles to the study of education policy. The course content revolves around issues of efficiency, equity, and freedom of choice. Specific attention is devoted to school finance litigation and reform, practices for raising and allocating resources, and education productivity issues.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Jing Liu"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      4,
                      15,
                      "Pm"
                    ],
                    [
                      7,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TWS",
                  "0223"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY688F",
      "name": "Topics in Public Policy; State, Local &amp; Non-Profit Financial Management",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Nathan Dietz"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "W": [
                  [
                    6,
                    30,
                    "Pm"
                  ],
                  [
                    9,
                    0,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        },
        {
          "sec_code": "01",
          "instructors": [
            "Nathan Dietz"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "W": [
                  [
                    6,
                    30,
                    "Pm"
                  ],
                  [
                    9,
                    0,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        },
        {
          "sec_code": "1",
          "instructors": [
            "Nathan Dietz"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "W": [
                  [
                    6,
                    30,
                    "Pm"
                  ],
                  [
                    9,
                    0,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY688X",
      "name": "Topics in Public Policy; Human Dignity",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Restricted to PLCY majors or permission of instructor.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Chloe Schwenke"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      1,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "HBK",
                  "0123"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY689E",
      "name": "Public Policy Topics; Program Evaluation and Cost-Benefit Analysis",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Restricted to PLCY majors or permission of instructor.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Douglas Call"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      4,
                      15,
                      "Pm"
                    ],
                    [
                      6,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0225"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY689L",
      "name": "Public Policy Topics; Science and Technology Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Jointly offered with PHYS798J. Credit only granted for PLCY689L or PHYS7 98J.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Sylvester Gates",
            "Rosina Bierbaum"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      7,
                      0,
                      "Pm"
                    ],
                    [
                      9,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0225"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "1",
          "instructors": [
            "Sylvester Gates",
            "Rosina Bierbaum"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      7,
                      0,
                      "Pm"
                    ],
                    [
                      9,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0225"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY689X",
      "name": "Public Policy Topics; Performance Management and Leadership",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "For PLCY majors or permission of instructor.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Mark Hubbard"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      7,
                      0,
                      "Pm"
                    ],
                    [
                      9,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0102"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY689Y",
      "name": "Public Policy Topics; Nonprofit Fundraising",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Ebonie Johnson Cooper"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "M": [
                  [
                    4,
                    15,
                    "Pm"
                  ],
                  [
                    6,
                    45,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        },
        {
          "sec_code": "01",
          "instructors": [
            "Ebonie Johnson Cooper"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "M": [
                  [
                    4,
                    15,
                    "Pm"
                  ],
                  [
                    6,
                    45,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        },
        {
          "sec_code": "1",
          "instructors": [
            "Ebonie Johnson Cooper"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "M": [
                  [
                    4,
                    15,
                    "Pm"
                  ],
                  [
                    6,
                    45,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY689Z",
      "name": "Public Policy Topics; Strategic Management for NonProfit and Public Organizations",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Robert Sheehan"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "Tu": [
                  [
                    6,
                    30,
                    "Pm"
                  ],
                  [
                    9,
                    0,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        },
        {
          "sec_code": "01",
          "instructors": [
            "Robert Sheehan"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "Tu": [
                  [
                    6,
                    30,
                    "Pm"
                  ],
                  [
                    9,
                    0,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        },
        {
          "sec_code": "1",
          "instructors": [
            "Robert Sheehan"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "Tu": [
                  [
                    6,
                    30,
                    "Pm"
                  ],
                  [
                    9,
                    0,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY698A",
      "name": "Selected Topics in Public Affairs; Poverty Measurement and Alleviation",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Kathryn Edwards"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      1,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1103"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY698C",
      "name": "Selected Topics in Public Affairs; Intelligence and Policy: Executive, Congressional and Public Dimensions",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Must be in a major in PLCY-School of Public Policy; or permission of PLCY-School of Public Policy.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Ann White"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      4,
                      15,
                      "Pm"
                    ],
                    [
                      6,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "JMZ",
                  "0120"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY698D",
      "name": "Selected Topics in Public Affairs; Social Entrepreneurship",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Bethany Henderson"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "Th": [
                  [
                    6,
                    30,
                    "Pm"
                  ],
                  [
                    9,
                    0,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        },
        {
          "sec_code": "01",
          "instructors": [
            "Bethany Henderson"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "Th": [
                  [
                    6,
                    30,
                    "Pm"
                  ],
                  [
                    9,
                    0,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        },
        {
          "sec_code": "1",
          "instructors": [
            "Bethany Henderson"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "Th": [
                  [
                    6,
                    30,
                    "Pm"
                  ],
                  [
                    9,
                    0,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY698E",
      "name": "Selected Topics in Public Affairs; Proseminar in Normative Public Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Robert Sprinkle"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      4,
                      15,
                      "Pm"
                    ],
                    [
                      6,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0102"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY698R",
      "name": "Selected Topics in Public Affairs; Developmental Challenges",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Restricted to PLCY Majors or permission of instructor.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Mario Picon"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      4,
                      15,
                      "Pm"
                    ],
                    [
                      6,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "JMZ",
                  "1124"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY699K",
      "name": "Selected Topics Public Policy; Civil Conflict",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "For PLCY Majors or permission of instructor.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Alec Worsnop"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      9,
                      15,
                      "Am"
                    ],
                    [
                      11,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0102"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY699Z",
      "name": "Selected Topics Public Policy; Climate and Energy Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "For PLCY Majors or permission of instructor.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Nathan Hultman"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      1,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0102"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY720",
      "name": "International Security Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Reviews the principal features of international security as currently practiced. Traces the evolution of contemporary policy beginning with the initiation of nuclear weapons programs during World War II. Particular emphasis is given to experience of the United States and Russia, since the historical interaction between these two countries has disproportionately affected the international security conditions that all other countries now experience.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Nancy Gallagher"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      1,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "1301"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY742",
      "name": "Environmental Ethics",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Analyzes issues such as the relation between human beings and nature from the perspectives of the science, history, philosophy, and religion. Considers the bases for policies such as environmental regulation, public lands, and international conventions with respect to the environment.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Thomas Hilde"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      7,
                      0,
                      "Pm"
                    ],
                    [
                      9,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0102"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY745",
      "name": "Human Health and Environmental Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Reviews the major human physiological systems and their integrated toxicological functions; considers key bodily defenses; and discusses classic, emerging, and ambiguous risks; in all ecological context. Applies to scientific controversy, the methods of policy formation, such as risk analysis, social-cost analysis, \"outcomes\" analysis, and decision analysis, all in political-economic context.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Robert Sprinkle"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      4,
                      15,
                      "Pm"
                    ],
                    [
                      6,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0102"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY780",
      "name": "The American Foreign Policy-Making Process",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Survey and analysis of the governmental institutions and processes which shape U.S. global engagement on national security and international economic issues. Particular emphasis is given to executive-congressional relations and the broader domestic roots of foreign policy.",
      "sections": [
        {
          "sec_code": "0201",
          "instructors": [
            "Joshua Itzkowitz Shifrinson"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      4,
                      15,
                      "Pm"
                    ],
                    [
                      6,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SKN",
                  "1115"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY782",
      "name": "International Development Economics",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Examines key current economic and policy issues for developing and transition economies. Topics include inflation stabilization, fiscal policy, selected trade issues, dealing with international capital flows, the role of multilateral organizations, such as the International Monetary Fund and the World Bank, and issues relating to saving, investment and growth.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Susan Parker"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      1,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0102"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY790",
      "name": "Project Course",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Students work at a sponsoring government agency or private firm researching problem of interest to sponsor and relevant to concentration. Emphasis on problem definition, organizing information, and both oral and written presentation of results.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Douglas Call"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      7,
                      0,
                      "Pm"
                    ],
                    [
                      9,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "1301"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Niambi Carter"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      4,
                      15,
                      "Pm"
                    ],
                    [
                      6,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "1301"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0301",
          "instructors": [
            "David Backer"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      1,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "2202"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0311",
          "instructors": [
            "Anand Patwardhan"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      1,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "1301"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0401",
          "instructors": [
            "Paul Brown"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      1,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "1301"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0521",
          "instructors": [
            "Angela Bies"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      4,
                      15,
                      "Pm"
                    ],
                    [
                      6,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "1301"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY798A",
      "name": "Readings in Public Policy",
      "credits": {
        "Range": [
          1,
          3
        ]
      },
      "gen_eds": null,
      "description": "",
      "sections": null
    },
    {
      "code": "PLCY798B",
      "name": "Readings in Public Policy",
      "credits": {
        "Range": [
          1,
          3
        ]
      },
      "gen_eds": null,
      "description": "",
      "sections": null
    },
    {
      "code": "PLCY798D",
      "name": "Readings in Public Policy; Writing for Academic Publication",
      "credits": {
        "Amount": 1
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Katrina Walsemann"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TMH",
                  "0201"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY798G",
      "name": "Readings in Public Policy; Impact Evaluation for Education and Public Policy",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Prerequisite: Knowledge of multivariate regression and prior experience with statistical programming software (e.g., Stata). TLPL765 or permission from instructor. Restriction: Must be in a major in PLCY-School of Public Policy; or per mission of PLCY-School of Public Policy. Cross-listed with TLPL766. Credit only granted for TLPL766 or PLCY798G.<br><br> Students will learn about and practice using a variety of quantitative research methods that allow for causal inferences and can be applied to estimate the impact of policies or programs in education and other policy sectors.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Francisco Lagos Marin"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      4,
                      15,
                      "Pm"
                    ],
                    [
                      7,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "JMZ",
                  "1122"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY798P",
      "name": "Readings in Public Policy; Data Analysis for Policy Makers",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Charles Harry"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      1,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SYM",
                  "0209"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "PLCY798Y",
      "name": "Readings in Public Policy; Nonprofit Management and Leadership",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Jeffrey Franco"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "W": [
                  [
                    4,
                    15,
                    "Pm"
                  ],
                  [
                    6,
                    45,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        },
        {
          "sec_code": "01",
          "instructors": [
            "Jeffrey Franco"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "W": [
                  [
                    4,
                    15,
                    "Pm"
                  ],
                  [
                    6,
                    45,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        },
        {
          "sec_code": "1",
          "instructors": [],
          "class_meetings": []
        }
      ]
    },
    {
      "code": "PLCY898",
      "name": "Pre-Candidacy Research",
      "credits": {
        "Range": [
          1,
          8
        ]
      },
      "gen_eds": null,
      "description": "",
      "sections": null
    },
    {
      "code": "PLCY899",
      "name": "Doctoral Dissertation Research",
      "credits": {
        "Amount": 6
      },
      "gen_eds": null,
      "description": "",
      "sections": null
    }
  ]
}