{
  "name": "BSST",
  "courses": [
    {
      "code": "BSST331",
      "name": "Innovations in Counterterrorism",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Explore the manners in which states respond to terrorist incidents and the threat of terrorism through counterterrorism approaches and strategies. We will examine counterterrorism responses from law enforcement, military, and the intelligence community. This will include discussions about policy decisions made in response to both terrorist attacks and the threat of terrorism. Counterterrorism strategies this course will cover include deterrence, interdiction, and legal efforts to combat terrorism, including terrorist financing and online recruitment. The course is divided into four general parts. First, we will provide an overview of government counterterrorism options and review key concepts. Second, we will examine law enforcement responses to terrorism including efforts to counter cyberterrorism, social media recruitment, and terrorist financing online. Third, we will focus on military responses to attacks conducted by terrorist groups, including deterrence strategies, targeted strikes, and covert operations. Last, we will review the challenges and complexities of counterterrorism approaches, including the ethical, moral, and legal dilemmas.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Thomas Guarrieri"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "ESJ",
                  "1309"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "BSST338R",
      "name": "Special Topics in Terrorism Studies; Far-Right Extremism: Violent Ideologies and Actions",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "This course will introduce students to the ideologies, organizing patterns, and actions within far-right extremism. This will include a focus on movements within white supremacism, anti-government extremism, male supremacy, homophobia, and anti-immigrant extremism. Using as examples specific violent extremists and groups on the far right, we will study key theories explaining extremist radicalization, recruitment, engagement, and mobilization.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Amy Pate"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "HJP",
                  "2242"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Amy Pate"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "HJP",
                  "2242"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "BSST377",
      "name": "Applying Theory to the Practice of Countering Terrorism",
      "credits": {
        "Amount": 1
      },
      "gen_eds": null,
      "description": "Focuses on current events related to terrorism and counterterrorism, as they are discussed in mass media, and the implications of those current events on the ethical and professional conduct of the counterterrorism community. Through a discussion-based seminar, students will bring current, terrorism-related events to classroom discussion, where they will consider the media-framed current events in relation to academic research. Students will be continually challenged to draw connections between terrorism-related events in the news and relevant academic research. Furthermore, this class will use vignettes based in current events to present students with real-world ethical dilemmas that those in the professional counterterrorism community and broader national security community have to confront.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Jason Blazakis"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      2,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "HJP",
                  "2217"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "BSST386",
      "name": "Experiential Learning in Terrorism Studies",
      "credits": {
        "Range": [
          1,
          5
        ]
      },
      "gen_eds": null,
      "description": "This course will supplement student's experiential learning experience, or internship in the field of terrorism studies and homeland security with guided reflection on their experiences.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Liberty Day"
          ],
          "class_meetings": [
            "OnlineAsync"
          ]
        }
      ]
    },
    {
      "code": "BSST631",
      "name": "Societal Impacts of and Responses to Terrorism",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Explores the manners in which a variety of different actors respond to both terrorist incidents and the threat of terrorism. Examines local responses to terrorist incidents; local impacts of terrorism including effects on individual and group attitudes and behaviors; policy decisions made in response to both terrorist attacks and the threat of terrorism; terrorism prevention, deterrence, interdiction, and mitigation efforts; and individual and community recovery from terrorist attacks.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Michael Egnoto"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "W": [
                  [
                    6,
                    0,
                    "Pm"
                  ],
                  [
                    8,
                    30,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "BSST633",
      "name": "Research Methods in Terrorism and Counterterrorism",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Provides students with the opportunity to conduct original research, while exposing them to analytical tools relevant to the study of terrorism. Students will work with a range of data sources on domestic and international terrorism, and will be tasked with using data to test hypotheses related to the causes, behaviors, and/ or impacts of terrorism.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Marcus Boyd"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "M": [
                  [
                    6,
                    0,
                    "Pm"
                  ],
                  [
                    8,
                    30,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "BSST636",
      "name": "Quantitative Research Methods in Terrorism Studies",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Introduction to probability, statistics and data analysis, particularly with respect to how they are used in the study of terrorism. Students will learn fundamental principles of probability and statistical inference, how to summarize data and make statistical inferences, and how to manipulate and analyze data in a statistical software package (Stata) that is widely used in the discipline. The course provides a foundation in quantitative analysis that will enable students to critically evaluate extant quantitative research and manipulate their own data. It will also prepare interested students for more advanced statistics training.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Thomas Guarrieri"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "W": [
                  [
                    6,
                    0,
                    "Pm"
                  ],
                  [
                    8,
                    30,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "BSST643",
      "name": "Great Powers &amp; Near-Peer Competition",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Focused on the emerging threats posed by state actors termed as \"near-peers,\" including topics germane to near-peer competitors, most notably China, Russia, and Iran, but will cover other state actors as necessary. The course also investigates the past, present, and future of the most powerful states in the international system, the great powers, and how they compete, and cooperate in international relations. By examining the various aspects of the great powers and near-peer competitors, students will learn how geography, politics, economics, technology, and ideology play a role in global competition.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Margaret Smith"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "M": [
                  [
                    6,
                    0,
                    "Pm"
                  ],
                  [
                    8,
                    30,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "BSST645",
      "name": "Non-state Actors Threats and Responses",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "The Non-State Actor. Running the gamut from Freedom fighters to Corporatized extortionists, NSAs play a pivotal role in the modern fields of combat. Some maintain loose state-level ties with high deniability, others rage against their domestic governments and facilitate foreign influence, but all present a modern adversary that Western Allies and Governments need to anticipate, track, and overcome. This course will provide an overview of the types of non-state actors that influence state actions. The course will examine the economic, political, and social costs of the proliferation of non-state actors globally. While the course will discuss terrorist groups, the main focus of the course will be on actors such as militant groups, insurgent groups, drug cartels, and illicit financial actors.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Michael Egnoto"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "Tu": [
                  [
                    6,
                    0,
                    "Pm"
                  ],
                  [
                    8,
                    30,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "BSST650",
      "name": "Foundations of Insider Risk Management &amp; Mitigation",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "The risks posed by trusted insiders to organizations in both the public and private sector are well documented. Past compromises of national security information have provided sensitive information to US adversaries; theft or compromise of proprietary data and intellectual property has impacted businesses large and small; and, incidents of workplace violence perpetrated by insiders are on the rise. This course provides context for the counter insider threat mission and explores multi-disciplinary insider risk management concepts. The course addresses matters of policy, political and socio-economic impacts, psychological factors, and gives special consideration to issues of cyber insider threat, privacy and civil liberties, kinetic violence, and related social and behavioral science research.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Steve Sin"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "Th": [
                  [
                    6,
                    0,
                    "Pm"
                  ],
                  [
                    8,
                    30,
                    "Pm"
                  ]
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "BSST697",
      "name": "Capstone",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "The capstone course allows MPS students the ability to take what they have learned throughout their coursework and apply theories, methods, analysis, and policy in the form of a final project. The project can originate from work experience or the student's interests. Projects will be developed in conjunction with a member of the graduate faculty who will oversee the student's progress. By the end of the semester, each student is expected to have completed their individual project. The project should further the student's intellectual and career goals and can take the form of practical analysis, policy, or a more academic approach. Students will present their capstone project in written form and will also be required to present their research via an online colloquium. Students are expected to meet with a capstone advisor at least once a week and will devote considerable time developing the project individually.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Thomas Guarrieri"
          ],
          "class_meetings": [
            "OnlineAsync"
          ]
        }
      ]
    }
  ]
}