{
  "name": "NAVY",
  "courses": [
    {
      "code": "NAVY101",
      "name": "Sea Power and Maritime Affairs",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS"
      ],
      "description": "Introduces the student to the key themes of naval and maritime history. Curriculum presents an analysis through lectures, reading, and student discussion of the relationship of sea power to American history. Classical concepts and contemporary employment of sea power are examined by viewing historic and current naval and maritime developments.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Tighe Bailey"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      8,
                      0,
                      "Am"
                    ],
                    [
                      9,
                      15,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "ARM",
                  "0120"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "NAVY108",
      "name": "Naval Science Leadership Lab",
      "credits": {
        "Amount": 1
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Jenna Weiner",
            "John Howrey"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      7,
                      0,
                      "Am"
                    ],
                    [
                      7,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "ESJ",
                  "1224"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "NAVY201",
      "name": "Navigation",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSSP"
      ],
      "description": "Introduces the student to a broad yet thorough education in basic surface ship navigation. Curriculum presents an overview of tools of the modern naval watch officer, and topics include celestial navigation, rules of the nautical road, piloting, practical chartwork, tides, instruments, publications, records, and electronic navigation systems. Instructional sessions and/or activities develop the maritime proficiency core competency of the Naval Reserve Officer Training Corps (NROTC) program.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "GABRIELLA ROSELLE"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      8,
                      0,
                      "Am"
                    ],
                    [
                      9,
                      15,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "ARM",
                  "0120"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "NAVY301",
      "name": "Naval Ship Systems II (Weapons)",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Introduces the student to a comprehensive fundamental understanding of United States naval weaponry.  Includes theory and employment of weapons systems, including the processes of detection, evaluation, threat analysis, weapon selection, delivery, guidance, and explosives. Radar and sonar systems and major weapon types, including capabilities and limitations. Facets of command, control, and communications as means of weapons system integration. Curriculum presents an in-depth review of surface, sub-surface, aviation, and Marine Corps weapons and platforms.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Tighe Bailey"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      8,
                      0,
                      "Am"
                    ],
                    [
                      9,
                      15,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "SYM",
                  "0215"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "NAVY401",
      "name": "Leadership and Ethics",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHU",
        "SCIS"
      ],
      "description": "Integrates an intellectual exploration of Western moral traditions and ethical philosophy with military leadership, core values, the Uniform Code of Military Justice, and Navy regulations. The course provides students with a basic understanding of major moral traditions including Relativism, Utilitarianism, Kantian Ethics, Natural Law Theory, Divine Command Theory, and Virtue Ethics.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "John Howrey"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "ESJ",
                  "1309"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "NAVY402",
      "name": "Fundamentals of Maneuver Warfare",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSSP"
      ],
      "description": "A detailed study of the characteristics of modern warfare and their interactions with maneuver warfare doctrine, with a focus on the United States Marine Corps. Throughout the course, there is a strong focus on leadership, as the fundamental purpose of this course is to develop the skills, knowledge, leadership background and mentality necessary for a successful future leadership and service, whether in the military or the civilian sector.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Jenna Weiner"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      8,
                      0,
                      "Am"
                    ],
                    [
                      9,
                      15,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "ESJ",
                  "1309"
                ]
              }
            }
          ]
        }
      ]
    }
  ]
}