{
  "name": "IMMR",
  "courses": [
    {
      "code": "IMMR319D",
      "name": "Special Topics in Immigration and Migration Studies; Black Immigrants: Challenges and Impacts",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Cross-listed with AASP398B. Credit only granted for AASP398B or IMMR319D.<br><br> How does immigration affect Black communities in the United States? How are foreign Black affected by living in the United States? Students will learn about: US history of immigration policy; pull and push factors driving Black migration; comparisons in socioeconomic outcomes between foreign and native Blacks; and differences between 1st and 2nd generation Black immigrants.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Beka Guluma"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "KEY",
                  "0100"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "IMMR394",
      "name": "Growing Up Asian American: The Asian Immigrant Family and the Second Generation",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DVCC"
      ],
      "description": "An interdisciplinary course examines the experiences of children of Asian immigrants in the U.S., focusing on intergenerational dynamics in the Asian immigrant family, their intersections with race, gender, class, sexuality, and religion, and how these shape second-generation Asian American life. Topics include identity and personhood, the model minority myth and education, work and leisure, language and communication, filiality and disownment, mental health and suicide.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Joan Hong"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      3,
                      0,
                      "Pm"
                    ],
                    [
                      4,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TWS",
                  "1107"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "IMMR399",
      "name": "Internship in Immigration/Migration Studies",
      "credits": {
        "Range": [
          1,
          6
        ]
      },
      "gen_eds": null,
      "description": "Restriction: Permission of IMMR department; and junior standing or higher.<br><br> The Immigration and Migration Studies Internship program. Pre-professional experience in migration studies research, analysis, and writing in a variety of work settings.  Contact department for information to register at globalmigration@umd.edu.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Katarina Keane"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        }
      ]
    },
    {
      "code": "IMMR400",
      "name": "Vital Voices: Oral Histories of the Immigrant Experience",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "An exploration of the dynamic subject of U.S. immigrant experience through the scope of individual immigrant life stories in a global context.  Course will include an overview of U.S. and global immigration patterns and an introduction to the practice of oral history.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Colleen Woods"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TLF",
                  "1101"
                ]
              }
            }
          ]
        }
      ]
    }
  ]
}