{
  "name": "SMLP",
  "courses": [
    {
      "code": "SMLP471",
      "name": "Entrepreneurial Finance",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Examine the elements of entrepreneurial finance, develop and analyze financial statements, focusing on technology-based startup ventures and the early stages of company development. Address key questions that challenge all entrepreneurs: how much money can and should be raised; when it should be raised and from whom; how to define a reasonable valuation of a company; and how to structure funding, develop employment contracts, and make exit decisions. Analyze the variety of financing models across a venture's life cycle, with an aim to understanding the incentives of each type of investor and the relative costs and benefits of each source of funding.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Brian Baick"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1119"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "SMLP473",
      "name": "Consulting in Tech Entrepreneurship",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Apply the entrepreneurship/business principles learned in the classroom to real-world consulting projects. Gain practical experience by solving actual business situations and by dealing with ambiguity and uncertainty inherent in fast-moving technical organizations. Develop key skills in negotiation, group dynamics, organization, and planning.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Instructor: TBA"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "HJP",
                  "2242"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "SMLP474",
      "name": "Essentials of Negotiations and Marketing for Entrepreneurs",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Building on the innovation and entrepreneurship knowledge acquired in previous SMLP courses, this team-taught course will equip students with the experience to conduct successful negotiations and bring an innovation to market. In the first half of this course, you will learn more about your individual negotiation style and practice the skills and techniques essential to a successful negotiation. You will then apply some of those skills, along with the human-centered mindset cultivated in previous SMLP courses, to introduce an existing product to the marketplace by identifying the promotion, distribution, and pricing tactics that meet the preferences of the intended target market. The course will conclude with a live presentation of your comprehensive go-to-market strategy to a panel of real investors, followed by a mock negotiation for an investment in bringing that product to market.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Sara Herald"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TWS",
                  "1310"
                ]
              }
            }
          ]
        }
      ]
    }
  ]
}