{
  "name": "ENBC",
  "courses": [
    {
      "code": "ENBC312",
      "name": "Object Oriented Programming in C++",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Provides a solid foundation for object-oriented programming using the C++ programming language. It introduces fundamental conceptual tools and their implementation of object-oriented design and programming such as: object, type, class, implementation hiding, inheritance, parametric typing, function overloading, polymorphism, source code reusability, and object code reusability. Fundamental principles of object-oriented design and programming are stressed while covering the language details.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Kyunghun Lee"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      5,
                      0,
                      "Pm"
                    ],
                    [
                      7,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "2335"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENBC321",
      "name": "Machine Learning for Data Analysis",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Instructs students in the fundamentals of machine learning methods through examples in the biological phenomenon and clinical data analysis. This course is designed to share knowledge of real-world data science and aid to learn complex machine learning theory, algorithms, and coding libraries in a simple way. Students will learn the machine learning theory, but they will also get hands-on practice building their models using programming tools such as Python and R.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Bardia Yousefi"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      10,
                      30,
                      "Am"
                    ],
                    [
                      11,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "4321"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENBC342",
      "name": "Computational Fluid Dynamics and Mass Transfer",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Principles and applications of fluid mechanics with a focus on bioengineering topics. Content includes conservation of mass, momentum, and energy, as well as the application of these fundamental relations to hydrostatics, control volume analysis, internal and external flow, and boundary layers. Applications to biological and bioengineering problems such as tissue engineering, bioprocessing, imaging, and drug delivery.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Lan Ma"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      1,
                      30,
                      "Pm"
                    ],
                    [
                      2,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "5321"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENBC351",
      "name": "Quantitative Molecular and Cellular Biology",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Provides a quantitative analysis of the behavior of cellular and molecular systems. The focus will be the construction and application of mechanistic models of biomolecular interaction rate processes, which form the foundation of most biological functions. The course will also provide in-depth, practical exploration into data analysis of key bioengineering techniques.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Jarred Callura"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "3321"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENBC352",
      "name": "Molecular Techniques Laboratory",
      "credits": {
        "Amount": 2
      },
      "gen_eds": null,
      "description": "Provides students with the opportunity to learn how biology and engineering can synergistically contribute to our understanding of biological and biomedical problems. Students will gain hands-on experience through wet lab experiments in basic techniques relevant to bioengineering.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Jarred Callura"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      5,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "4321"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      1,
                      30,
                      "Pm"
                    ],
                    [
                      2,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "4322"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENBC403",
      "name": "Research Methods in Biological Data Mining",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "An introduction to the fundamentals of conducting research projects utilizing a general understanding of quantitative/qualitative research, clinical data analysis, and multiple examples of different research approaches in the biological phenomenon. The course includes an overview of design strategies to implement various data mining technologies.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Bardia Yousefi"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      1,
                      30,
                      "Pm"
                    ],
                    [
                      2,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "4321"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENBC424",
      "name": "AI for Biocomputational Engineering",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Introduces students to the basics and modern deep learning models in the Artificial Intelligence field applied to computer vision problems. The course will teach ResNet for image Classification/Regression, and U-Net for semantic segmentation. The course emphasizes applications of computer vision in medical imaging and cell biology, such as detecting brain tumor using semantic deep learning segmentation network and track dynamic measurements of live 3T3 cells through time using recurrent neural network. Computer vision techniques will be demonstrated using software packages implementing bio-image informatics methods, including ImageJ (FIJI), Python with Keras Tensorflow, Pytorch, and Matlab.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Joe Chalfoun"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      9,
                      0,
                      "Am"
                    ],
                    [
                      10,
                      15,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "5210"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENBC441",
      "name": "Computational Systems Biology",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Introduces quantitative principles for studying biological systems using computational modeling and simulations. Topics include continuous modeling of systems using ordinary differential equations, discrete modeling using Boolean networks and Markov chains, probabilistic modeling through Bayesian networks, stochastic modeling via Monte Carlo and Brownian and molecular dynamics, model optimization, and parameter estimation. Simulation algorithms that implement these approaches will be introduced through MATLAB programming.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Lan Ma"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      30,
                      "Am"
                    ],
                    [
                      12,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "5308"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENBC455",
      "name": "Bioinformatics Engineering",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Introduces students to the core principles of bioinformatics while encouraging students to apply their programming skills to real-world biological problems. Students will learn to utilize Python to process data sets.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Jarred Callura"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "3321"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "ENBC491",
      "name": "Senior Capstone Design in Biocomputational Engineering",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Senior design project in which students work collaboratively in a Capstone team on a biocomputational topic. Under the guidance of a Capstone mentor, students will set project goal(s), propose project design, identify methodology, implement solutions, evaluate project results, and iterate among these steps if needed. Students will present their completed biocomputational projects to the public in a poster session. To complement the project design and implementation, students will also learn pressing ethics and DEI concerns emerging in artificial intelligence (AI), and recognize ethical responsibilities in biocomputational tasks.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Lan Ma"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      10,
                      30,
                      "Am"
                    ],
                    [
                      12,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "5210"
                ]
              }
            },
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      11,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "BLD4",
                  "5210"
                ]
              }
            }
          ]
        }
      ]
    }
  ]
}