{
  "name": "SURV",
  "courses": [
    {
      "code": "SURV400",
      "name": "Fundamentals of Survey and Data Science",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "The course introduces the student to a set of principles of survey and data science that are the basis of standard practices in these fields. The course exposes the student to key terminology and concepts of collecting and analyzing data from surveys and other data sources to gain insights and to test hypotheses about the nature of human and social behavior and interaction. It will also present a framework that will allow the student to evaluate the influence of different error sources on the quality of data.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Robyn Ferg"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "2113"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "SURV410",
      "name": "Introduction to Probability Theory",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Probability and its properties. Random variables and distribution functions in one and several dimensions. Moments. Characteristic functions. Limit theorems.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Mestiyage Gunatilleka"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      12,
                      30,
                      "Pm"
                    ],
                    [
                      1,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SYM",
                  "0215"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Wiseley Wong"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MWF": [
                    [
                      10,
                      0,
                      "Am"
                    ],
                    [
                      10,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "MTH",
                  "B0429"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0301",
          "instructors": [
            "Lutian Zhao"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MWF": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      11,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "PHY",
                  "2211"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0501",
          "instructors": [
            "Takumi Saegusa"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "MTH",
                  "B0421"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0601",
          "instructors": [
            "Yu Gu"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "PHY",
                  "2213"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "SURV420",
      "name": "Theory and Methods of Statistics",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Point estimation, sufficiency, completeness, Cramer-Rao inequality, maximum likelihood. Confidence intervals for parameters of normal distribution. Hypothesis testing, most powerful tests, likelihood ratio tests. Chi-square tests, analysis of variance, regression, correlation. Nonparametric methods.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Jonathan Fernandes"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MWF": [
                    [
                      12,
                      0,
                      "Pm"
                    ],
                    [
                      12,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "MTH",
                  "B0421"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Jian Lun Xu"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      5,
                      0,
                      "Pm"
                    ],
                    [
                      6,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "PHY",
                  "2214"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "SURV430",
      "name": "Fundamentals of Questionnaire Design",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Introduction to the scientific literature on the design, testing and evaluation of survey questionnaires, together with hands-on application of the methods discussed in class.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Christopher Antoun"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1208"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "SURV440",
      "name": "Sampling Theory",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Simple random sampling, sampling for proportions, estimation of sample size, sampling with varying probabilities of selection, stratification, systematic selection, cluster sampling, double sampling, and sequential sampling.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Trivellore Raghunathan"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      8,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      0,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1208"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "SURV613",
      "name": "Machine Learning for Social Science",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Introduction to supervised statistical learning techniques such as decision trees, random forests and boosting and discusses their potential application in the social sciences. These methods focus on predicting an outcome Y based on some learned function f(X) and therefore facilitate new research perspectives in comparison with traditional regression models, which primarily focus on causation. Predictive methods also provide a valuable extension to the empirical social scientists' toolkit as new data sources become more prominent. In addition to introducing supervised learning methods, the course will include practical sessions to exemplify how to tune and evaluate prediction models using the statistical programming language R.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Brian Kim"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      10,
                      30,
                      "Am"
                    ],
                    [
                      1,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1208"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "SURV616",
      "name": "Statistical Modeling and Machine Learning II",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Build on material presented in Statistical Methods and Machine Learning I. Topics include: categorical data analysis, logistic regression, model selection for inference and prediction, classification using K-means and neural networks, survival analysis, principal components, and factor analysis.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "James Wagner"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      12,
                      30,
                      "Pm"
                    ],
                    [
                      3,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1208"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "1",
          "instructors": [
            "James Wagner"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "F": [
                    [
                      12,
                      30,
                      "Pm"
                    ],
                    [
                      3,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1208"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "SURV622",
      "name": "Fundamentals of Data Collection II",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "This is the second course in a two-semester sequence that provides a broad overview of the processes that generate data for use in social science research. Students will gain an understanding of different types of data and how they are created, as well as their relative strengths and weaknesses. A key distinction is drawn between data that are designed, primarily survey data, and those that are found, such as administrative records, remnants of online transactions, and social media content. The course combines lectures, supplemented with assigned readings, and practical exercises. The second semester builds on the discussion of survey mode during the first semester, considering the role played by interviewers in telephone and in-person surveys and their effects on the data collected. Students next are introduced to the methods for extracting and re purposing found data for social science research. Methods for the classification of text, with an emphasis on automated coding methods, are introduced and selected applications considered (e.g., coding of open-ended survey responses, classification of the sentiments expressed in social media posts). Issues in using survey data and administrative records to measure change over time (longitudinal comparisons) are explored. The term concludes with an examination of methods for evaluating the quality of both designed and found data.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Robyn Ferg",
            "Frederick Conrad"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      6,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1208"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "SURV625",
      "name": "Applied Sampling",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Practical aspects of sample design. Topics include: probability sampling (including simple random, systematic, stratified, clustered, multistage and two-phase sampling methods), sampling with probabilities proportional to size, area sampling, telephone sampling, ratio estimation, sampling error estimation, frame problems, nonresponse, and cost factors.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Michael Elliott"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      10,
                      15,
                      "Am"
                    ],
                    [
                      11,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "2208"
                ]
              }
            },
            "Unspecified"
          ]
        }
      ]
    },
    {
      "code": "SURV630",
      "name": "Questionnaire Design and Evaluation",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "The stages of questionnaire design; developmental interviewing, question writing, question evaluation, pretesting, and questionnaire ordering and formatting. Reviews of the literature on questionnaire construction, the experimental literature on question effects, and the psychological literature on information processing. Examination of the diverse challenges posed by self versus proxy reporting and special attention is paid to the relationship between mode of administration and questionnaire design.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Ting Yan"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      10,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1208"
                ]
              }
            },
            "Unspecified"
          ]
        },
        {
          "sec_code": "1",
          "instructors": [
            "Christopher Antoun"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1208"
                ]
              }
            },
            "Unspecified"
          ]
        }
      ]
    },
    {
      "code": "SURV631",
      "name": "Questionnaire Design",
      "credits": {
        "Amount": 2
      },
      "gen_eds": null,
      "description": "This course introduces students to the stages of questionnaire development. The course reviews the scientific literature on questionnaire construction, the experimental literature on question effects, and the psychological literature on information processing. It will also discuss the diverse challenges posed by self- versus proxy-reporting and special attention is paid to the relationship between mode of administration and questionnaire design. Students will also get hands-on experience in developing their own questionnaire.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Gina Walejko"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "F": [
                  [
                    12,
                    0,
                    "Pm"
                  ],
                  [
                    1,
                    0,
                    "Pm"
                  ]
                ]
              }
            },
            "OnlineAsync"
          ]
        }
      ]
    },
    {
      "code": "SURV635",
      "name": "Usability Testing for Survey Research",
      "credits": {
        "Amount": 1
      },
      "gen_eds": null,
      "description": "Introduces the concepts of usability and usability testing and why they are needed for survey research. The course provides a theoretical model for understanding the respondent-survey interaction and then provides practical methods for incorporating iterative user-centered design and testing into the survey development process. The course provides techniques and examples for designing, planning, conducting and analyzing usability studies on web or mobile surveys",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "EMILY  MCFARLANE GEISEN ",
            "Jennifer Romano"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "W": [
                  [
                    11,
                    0,
                    "Am"
                  ],
                  [
                    12,
                    0,
                    "Pm"
                  ]
                ]
              }
            },
            "OnlineAsync"
          ]
        }
      ]
    },
    {
      "code": "SURV636",
      "name": "Sampling II",
      "credits": {
        "Amount": 1
      },
      "gen_eds": null,
      "description": "Different applications of the methods and techniques covered in the Sampling I course. This is also an applied statistics methods course concerned almost exclusively with the design of data collection rather than data analysis. The course will concentrate on sampling applications to human populations, since this poses a number of particular problems not found in sampling of other types of units. The principles of sample selection, though, can be applied to many other types of populations.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Raphael Nishimura"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "Th": [
                  [
                    1,
                    0,
                    "Pm"
                  ],
                  [
                    2,
                    0,
                    "Pm"
                  ]
                ]
              }
            },
            "OnlineAsync"
          ]
        }
      ]
    },
    {
      "code": "SURV662",
      "name": "An Introduction to Small Area Estimation Methods",
      "credits": {
        "Amount": 1
      },
      "gen_eds": null,
      "description": "There is a growing demand to produce reliable estimates of various socio-economic and health characteristics at both national and sub-national levels. However, data availability at the sub-national (small area) level from a survey is often limited by cost and thus analysts must make the best possible use of all available information. The course will begin with a history of small-area estimation and different uses of small-area statistics in both public and private sectors. This course will provide an introduction to the main concepts and issues in small estimation and describes various approaches for estimating different small area parameters. Topics include standard design-based methods, various traditional indirect methods and the state-of-the-art small-area estimation methods that use both Bayesian and empirical best prediction methods. Monte Carlo simulation results and data analysis using available statistical software will be presented.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Partha Lahiri"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "Tu": [
                  [
                    12,
                    0,
                    "Pm"
                  ],
                  [
                    1,
                    0,
                    "Pm"
                  ]
                ]
              }
            },
            "OnlineAsync"
          ]
        }
      ]
    },
    {
      "code": "SURV675",
      "name": "Modern Workflows in Data Science",
      "credits": {
        "Amount": 2
      },
      "gen_eds": null,
      "description": "Large data, fast pace of production, and collaboration are hallmarks of the new data environment. In this context, researchers must have a good understanding of data workflows and they must ensure consistent and reproducible practices in order to collaborate and consistently produce insights. This course deals with some of these essential topics. We will discuss the main types of workflows in data and survey sciences and how tools such as GitHub can enhance collaboration and insure reproducibility. We will also discuss the use of reproducible documents such as Rmarkdown or Jupyter Notebooks before covering how to work with distributed data using Spark. We will finish the course by discussing the use of dashboards and how to develop such tools using R Shiny.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Alexandru Cernat"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "M": [
                  [
                    3,
                    0,
                    "Pm"
                  ],
                  [
                    4,
                    0,
                    "Pm"
                  ]
                ]
              }
            },
            "OnlineAsync"
          ]
        }
      ]
    },
    {
      "code": "SURV699",
      "name": "Special Topics in Survey Methodology; Readings in Survey Methodology",
      "credits": {
        "Range": [
          1,
          4
        ]
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Partha Lahiri"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Brian Kim"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        },
        {
          "sec_code": "0301",
          "instructors": [
            "Stanley Presser"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        },
        {
          "sec_code": "0401",
          "instructors": [
            "Frauke Kreuter"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        }
      ]
    },
    {
      "code": "SURV701",
      "name": "Analysis of Complex Sample Data",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Analysis of data from complex sample designs covers: the development and handling of selection and other compensatory weights; methods for handling missing data; the effect of stratification and clustering on estimation and inference; alternative variance estimation procedures; methods for incorporating weights, stratification and clustering, and imputed values in estimation and inference procedures for complex sample survey data; and generalized design effects and variance functions. Computer software that takes account of complex sample design in estimation.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Taylor Lewis"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1218"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "SURV721",
      "name": "Total Survey Error and Data Quality II",
      "credits": {
        "Amount": 2
      },
      "gen_eds": null,
      "description": "Second part of a review of total survey error structure of sample survey data. Reviewing current research findings on the magnitudes of different error sources. Students will continue work on an independent research project which provides empirical investigation of one or more error source. An analysis paper presenting findings of the project will be submitted at the end of the course.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Frauke Kreuter",
            "Frederick Conrad"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Th": [
                    [
                      9,
                      0,
                      "Am"
                    ],
                    [
                      11,
                      30,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1208"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "SURV742",
      "name": "Inference from Complex Surveys",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Inference from complex sample survey data covering the theoretical and empirical properties of various variance estimation strategies (e.g., Taylor series approximation, replicated methods, and bootstrap methods for complex sample designs). Incorporation of those methods into inference for complex sample survey data. Variance estimation procedures applied to descriptive estimators and to analysis of categorical data. Generalized variances and design effects presented. Methods of model-based inference for complex sample surveys examined, and results contrasted to the design-based type of inference used as the standard in the course. Real survey data illustrating the methods discussed. Students will learn the use of computer software that takes account of the sample design in estimation.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Robert Fay"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      1,
                      0,
                      "Pm"
                    ],
                    [
                      2,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1218"
                ]
              }
            },
            "Unspecified"
          ]
        }
      ]
    },
    {
      "code": "SURV745",
      "name": "Practical Tools for Study Design and Inference",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "A statistical methods class appropriate for second year Master's students and PhD students. The course will be a combination of hands-on applications and general review of the theory behinddifferent approaches to sampling and weighting. Topics covered include sample size calculations using estimation targets based on relative standard error, margin of error, and power requirements. Use of mathematical programming to determine sample sizes needed to achieve estimation goals for a series of subgroups and analysis variables. Resources for designing area probability samples. Methods of sample allocation for multistage samples. Steps in weighting, including computation of base weights, non response adjustments, and uses of auxiliary data. Non response adjustment alternatives, including weighting cell adjustments, formation of cells using regression trees, and propensity score adjustments. Weighting via post stratification, raking, general regression estimation, and other types of calibration.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Sunghee Lee"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "Tu": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      12,
                      0,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "1208"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "SURV750",
      "name": "Step by Step Survey Weighting",
      "credits": {
        "Amount": 1
      },
      "gen_eds": null,
      "description": "Learn to calculate analysis weights for various survey designs in a real-world setting. We will cover topics on calculating base weights for single- and multistage designs, adjusting weights for unknown study eligibility and nonresponse using a few techniques, and aligning survey estimates with known population values through weight calibration. We will use specialized software for the procedures mentioned. This course will emphasize R but some examples in SAS and Stata are also discussed.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Anna-Carolina Haensch"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "F": [
                  [
                    11,
                    0,
                    "Am"
                  ],
                  [
                    12,
                    0,
                    "Pm"
                  ]
                ]
              }
            },
            "OnlineAsync"
          ]
        }
      ]
    },
    {
      "code": "SURV751",
      "name": "Introduction to Big Data and Machine Learning",
      "credits": {
        "Amount": 1
      },
      "gen_eds": null,
      "description": "This is an introduction to the uses and methods of working with Big data. Students explore how Big Data concepts, processes and methods can be used within the context of Survey Research.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Frauke Kreuter",
            "Trent Buskirk"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "M": [
                  [
                    1,
                    0,
                    "Pm"
                  ],
                  [
                    2,
                    0,
                    "Pm"
                  ]
                ]
              }
            },
            "OnlineAsync"
          ]
        }
      ]
    },
    {
      "code": "SURV752",
      "name": "Introduction to Data Visualization",
      "credits": {
        "Amount": 1
      },
      "gen_eds": null,
      "description": "Data visualization is one of the most powerful tools to explore, understand and communicate patterns in quantitative information. At the same time, good data visualization is a surprisingly difficult task and demands three quite different skills: substantive knowledge, statistical skill, and artistic sense. The course is intended to introduce participants to a) key principles of analytic design and useful visualization techniques for the exploration and presentation of univariate and multivariate data. This course is highly applied in nature and emphasizes the practical aspects of data visualization in the social sciences. Students will learn how to evaluate data visualizations based on principles of analytic design, how to construct compelling visualizations using the free statistics software R, and how to explore and present their data with visual methods.",
      "sections": [
        {
          "sec_code": "1",
          "instructors": [
            "Richard Tranmueller"
          ],
          "class_meetings": [
            {
              "OnlineSync": {
                "W": [
                  [
                    12,
                    0,
                    "Pm"
                  ],
                  [
                    1,
                    0,
                    "Pm"
                  ]
                ]
              }
            },
            "OnlineAsync"
          ]
        }
      ]
    },
    {
      "code": "SURV772",
      "name": "Survey Design Seminar",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Students present solutions to design issues presented to the seminar. Readings are selected from literatures not treated in other classes and practical consulting problems are addressed.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Katharine Abraham"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      3,
                      0,
                      "Pm"
                    ],
                    [
                      5,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "LEF",
                  "2208"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "SURV829",
      "name": "Doctoral Research Seminar in Survey Methodology",
      "credits": {
        "Range": [
          3,
          6
        ]
      },
      "gen_eds": null,
      "description": "It runs concurrently with the University of Michigan course.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Sunghee Lee",
            "Stanley Presser"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      4,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": null
              }
            }
          ]
        }
      ]
    },
    {
      "code": "SURV898",
      "name": "Pre-Candidacy Research",
      "credits": {
        "Range": [
          1,
          8
        ]
      },
      "gen_eds": null,
      "description": "",
      "sections": null
    },
    {
      "code": "SURV899",
      "name": "Doctoral Dissertation Research",
      "credits": {
        "Amount": 6
      },
      "gen_eds": null,
      "description": "",
      "sections": null
    }
  ]
}