{
  "name": "USLT",
  "courses": [
    {
      "code": "USLT202",
      "name": "US Latina/o Studies II: A Contemporary Overview 1960's to present",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Interdisciplinary course on emerging populations of Latinos in the 20th century with a focus on the multiple waves of latino immigration as a result of neocolonialism, imperialism, globalization and transnationalism. Examines the positioning of immigrant waves in the political, sociocultural and historical contexts of US Latinidades.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Robert Chester"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "TWS",
                  "0134"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "USLT403",
      "name": "Citizens, Refugees, and Immigrants",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Citizenship, Refugee and Immigrant are guiding categories that often define the Latina/o community in the United States. Employing this analytical lens, this course critically engages with notions of exclusion and inclusion, which  included documentation, status, race, gender, and power. To better understand how these ideas and processes work, students are introduced to the history of Latina/o migration, US immigration policies, racial formation theory, gender construction, borderland theory, and the politics of territoriality.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Perla Guerrero"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      12,
                      0,
                      "Pm"
                    ],
                    [
                      1,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TWS",
                  "0134"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "USLT420",
      "name": "U.S. Latinas/os on the Silver Screen: The Silent Era to the Present Day.",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Combining media theory and film history, this course considers the film industry's relationship to Latinidad, examining issues such as the shift from silent film to sound, the impact made on Latina/o images by the Second World War, and Latinas/os in the  Red Scare. The second half of the course turns its attention to self-representation by Latina/o filmmakers and empathetic images created by whites in and after the 1970s.  Some of the questions that the course addresses include: How have Latinas/os been depicted in Hollywood history? How have inter-American foreign relations shaped the US Latina/o image? How have Latina/o filmmakers confronted issues such as racism and sexism in the United States?",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Robert Chester"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TWS",
                  "0134"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "USLT480",
      "name": "Race and Nation in U.S. Cinema",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "From the 1915 release of D.W. Griffith's The Birth of a Nation to the present, cinema has been a crucial medium through which cultural producers have advanced and contested concepts of ethnoracial and national identity in the US. This course adopts a historically-grounded practice of media criticism to understand the ideology and iconography of both Hollywood's studio system and independent cinema. The course requires students to examine film and identity through multiple, racial, methodological and theoretical lenses, including film history, and film and media theory. Focus will be the cinematic politics and poetics of racial exclusion and inclusion, empathy and disidentification, power and resistance, and the shaping of a national \"imagined community.\"  We will pursue how ideas about class, sexuality, gender, and disability have informed ideologies concerning race and nation. Classes will be divided between lecture, film viewings, and, most importantly, class discussions.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Robert Chester"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      12,
                      30,
                      "Pm"
                    ],
                    [
                      1,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TWS",
                  "0134"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "USLT488B",
      "name": "US Latina/o Senior Seminar",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "A variable topics seminar that exposed students to interdisciplinary critical readings, writings, and research in U.S. Latina/o Studies. Interdisciplinary research methodologies are broadly addressed. Students will gain skills and practice in reading critical analytic texts and will develop writing skills.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Nancy Mirabal"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      12,
                      30,
                      "Pm"
                    ],
                    [
                      1,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TWS",
                  "0328"
                ]
              }
            }
          ]
        }
      ]
    }
  ]
}