{
  "name": "CPSS",
  "courses": [
    {
      "code": "CPSS101",
      "name": "College Park Scholars: Science, Technology &amp; Society First-Year Colloquium II",
      "credits": {
        "Amount": 1
      },
      "gen_eds": null,
      "description": "Continued examination of issues related to science, technology and society.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Nicole Mogul",
            "Christine Alexander"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      4,
                      0,
                      "Pm"
                    ],
                    [
                      5,
                      20,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "CCC",
                  "1205"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "CPSS220",
      "name": "The Future of Communicating Science",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DVCC"
      ],
      "description": "How can scientists communicate their work effectively? The field of science communication ventures that the answer is not simply a matter of improving capacity (e.g., because people lack scientific information, scientists lack communication skills, or both). Rather, it calls for sustained collaboration and empathy between laypersons and experts. In this hands-on, experiential course, we use a model of cultural competency to put forth solutions to bridge the expert-lay divide. We investigate typical venues in which science is communicated (museums, YouTube videos, federal agency websites, and much much more) and study best practices for communication. Then we explore emerging venues that support sustained contact between so-called \"lay citizens\" and scientific or technical experts (dance/improv techniques, ethnographic methods and citizen science). Students learn to use cross-cultural perspectives as a basis to pilot and test ways of strengthening relationships and improving communication.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Nicole Mogul"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      12,
                      30,
                      "Pm"
                    ],
                    [
                      1,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "CCC",
                  "1115"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "CPSS225",
      "name": "College Park Scholars Capstone: Science, Technology, and Society",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS",
        "SCIS"
      ],
      "description": "Exploration and understanding of ways science and technology shape and are shaped by society.",
      "sections": [
        {
          "sec_code": "0301",
          "instructors": [
            "Roan Parrish"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "CCC",
                  "1115"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "CPSS240",
      "name": "College Park Scholars: Science, Technology &amp; Society - Service-Learning Practicum",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSSP",
        "SCIS"
      ],
      "description": "Supervised Service-Learning practicum in issues related to science, technology and society.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Kuan-Hung Lo"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      3,
                      30,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "CCC",
                  "1200"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "CPSS340",
      "name": "College Park Scholars: Infrastructure and Society",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSSP"
      ],
      "description": "One of the most important, and underappreciated, aspects of our society is its infrastructure (roads, buildings, communication systems, water delivery systems, sanitation systems, energy systems, etc.). We often take for granted the services infrastructure bring us. As a consequence, the United States, which at one time was a world leader in creating infrastructure, is experiencing an infrastructure crisis. Furthermore, not everyone experiences this issue equally. This course is designed to identify the root causes of the crisis. You will explore emerging social, political, legal, cultural, and social justice issues associated with the building and maintenance of infrastructure from the perspective of Science and Technology Studies (STS) and engineers. You will work with a volunteer corps of professional engineers from a variety of disciplines on a service-learning project designed to assess the safety and vitality of infrastructure.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "David Tomblin"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": null
              }
            }
          ]
        }
      ]
    }
  ]
}