{
  "name": "LEAD",
  "courses": [
    {
      "code": "LEAD217",
      "name": "Introduction to Leadership",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSSP"
      ],
      "description": "Surveys the study and practice of leadership and provides students with a variety of experiences to wrestle with large leadership questions. What is leadership? Who can be a leader? How is leadership an important aspect of understanding self and others? Students will explore and respond to these questions through a variety of leadership theories and models, self-assessments, critical reflection, active-learning, group projects, and research. The course will introduce students to critical theory and critical perspectives of leadership to help students broaden their perspectives on leadership and develop more complex thought and practice of leadership.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Pamela Scott"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TLF",
                  "0103"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Pamela Scott"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      12,
                      30,
                      "Pm"
                    ],
                    [
                      1,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "TLF",
                  "0103"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0301",
          "instructors": [
            "Anastasia Lavrenyuk"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      11,
                      0,
                      "Am"
                    ],
                    [
                      12,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "EDU",
                  "3233"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0401",
          "instructors": [
            "Anastasia Lavrenyuk"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "ESJ",
                  "B0322"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "LEAD321",
      "name": "Advanced Social Action Seminar",
      "credits": {
        "Amount": 1
      },
      "gen_eds": null,
      "description": "The purpose of the Social Action Sequence (LEAD 320 &amp; LEAD 321) is to examine the connections between leadership and social change, and learn how our own leadership knowledge and practice can be used to advance progress toward more just and equitable communities. Together we will explore socially-responsible approaches to leadership as the groundwork for this sequence. In LEAD 321 (1-credit), students will implement their action plan for regular engagement in their community related to their chosen social issue, practicing leadership approaches and skills to advance social change within their spheres of influence.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Brittany Devies"
          ],
          "class_meetings": [
            "OnlineAsync"
          ]
        }
      ]
    },
    {
      "code": "LEAD417",
      "name": "Leadership Studies Capstone",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "As the final academic experience in the Leadership Studies Minor/Certificate, this seminar is designed to be both retrospective and integrative, encouraging you to synthesize relevant concepts and experiences and to formulate your own informed perspective on the implications of leadership. This course will serve as a place to critically think about the field of leadership studies and the implications of leadership in multiple settings for life-long practice. You will be expected to demonstrate skill in analysis of pertinent literature, write with purpose and clarity, facilitate the learning and development of others, and engage in thoughtful group discussion.  In this seminar, you will submit scholarly products to demonstrate a mature understanding of your leadership trajectory in past, present and future contexts.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Brittany Devies"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "W": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1105"
                ]
              }
            }
          ]
        }
      ]
    }
  ]
}