{
  "name": "CHSE",
  "courses": [
    {
      "code": "CHSE205",
      "name": "Disability: From Stigma and Sideshow to Mainstream and Main Street",
      "credits": {
        "Amount": 3
      },
      "gen_eds": [
        "DSHS",
        "DVUP",
        "SCIS"
      ],
      "description": "Explores the cultural, historical, educational, and medical roots of difference among human beings and examines the impact of cultural and technological changes on individuals traditionally identified as disabled. The course is designed to develop a broad understanding of the concept of \"disability\" and the emerging technologies that shape contemporary understanding of this phenomenon and the lives of those considered disabled.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Yewon Lee"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "ESJ",
                  "2212"
                ]
              }
            }
          ]
        },
        {
          "sec_code": "0201",
          "instructors": [
            "Katryna Andrusik"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      11,
                      15,
                      "Am"
                    ],
                    [
                      12,
                      30,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "ESJ",
                  "2212"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "CHSE220",
      "name": "College and Career Studies",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "This course is a follow-up to CHSE200 to introduce goal planning and competencies that will lead to the earning of the TerpsEXCEED College and Career Studies Certificate. Students use a planning tool that will be carried through until they earn their College and Career Studies Certificate. Through this course, students will access lessons through the ChoiceMaker Self-Determination transition Curriculum and the ME! Lessons for Self-Advocacy developed by the Zarrow Institute on Transition &amp; Self-Awareness at the University of Oklahoma, and adapted for TerpsEXCEED.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Meredith Gramlich",
            "Amy D'Agati"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      9,
                      30,
                      "Am"
                    ],
                    [
                      10,
                      45,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "SQH",
                  "1111"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "CHSE388",
      "name": "Apprenticeship: Field Experience in a Work Setting",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "",
      "sections": null
    },
    {
      "code": "CHSE489",
      "name": " Internship - Terps Exceed",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "3201",
          "instructors": [
            "Stacie Brownrigg"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        }
      ]
    },
    {
      "code": "CHSE498",
      "name": "Independent Study",
      "credits": {
        "Range": [
          1,
          3
        ]
      },
      "gen_eds": null,
      "description": "",
      "sections": [
        {
          "sec_code": "1901",
          "instructors": [
            "Amy D'Agati"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        },
        {
          "sec_code": "2401",
          "instructors": [
            "Meredith Gramlich"
          ],
          "class_meetings": [
            "Unspecified"
          ]
        }
      ]
    },
    {
      "code": "CHSE601",
      "name": "Difficult Dialogues in Higher Education",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Difficult Dialogues are one of several frameworks and practices that help us grapple with challenging and sensitive issues in a variety of fields of study. Difficult dialogues are planned, purposeful educational interactions between individuals with divergent attitudes, beliefs, values, backgrounds, perspectives, and/or worldviews about complex social and moral dilemmas or controversies (Worthington &amp; Arevalo-Avalos, 2016). The course aims to create space for learners to foster greater understanding of personal and cultural complexities of academic communities, encourage a greater willingness to engage in evidence-based open discourse, and advance towards the resolution of social problems. The course is distributed across seminar, discussion and experiential learning activities, in which students research controversial topics in higher education, develop skills to facilitate dialogues across a variety of settings, and engage in facilitation of dialogues.",
      "sections": [
        {
          "sec_code": "0101",
          "instructors": [
            "Roger Worthington"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "M": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      4,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "JMZ",
                  "3122"
                ]
              }
            }
          ]
        }
      ]
    }
  ]
}