{
  "name": "BUMK",
  "courses": [
    {
      "code": "BUMK744",
      "name": "Marketing Research and Analytics",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "Provides a review of primary data collection methods for marketing data. Students will learn how to design and implement effective confirmatory research. Both direct methods such as surveys and indirect methods such as experiments will be covered. In this hands-on course, students will design and conduct research with target customers, analyze the data, and then present their results to decision makers.",
      "sections": [
        {
          "sec_code": "0501",
          "instructors": [
            "Bruno Jacobs"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      12,
                      30,
                      "Pm"
                    ],
                    [
                      1,
                      45,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "VMH",
                  "1336"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "BUMK746",
      "name": "Data Science for Customer Analytics",
      "credits": {
        "Amount": 3
      },
      "gen_eds": null,
      "description": "An introduction to data science and thebasic concepts of database management.  The course also provides an overview of the various sources of in house data that are available to many organizations. Students will learn how to work with click stream, scanner panel and social media data. Geo-demographic datasets will be discussed and explored, and techniques for data-fusion will receive ample attention.",
      "sections": [
        {
          "sec_code": "0501",
          "instructors": [
            "Liye Ma"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      15,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "VMH",
                  "1330"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "BUMK747",
      "name": "CRM Analytics",
      "credits": {
        "Amount": 2
      },
      "gen_eds": null,
      "description": "Customer Equity Management and Customer Relationship Marketing focuses on selective acquisition, development and retention of customers aided by developments in information technology and analytics - databases, online channels, social media, mobile technologies, and marketing analytics - with the objective of increasing a firm's customer equity (firm's value). This course will focus on the conceptual foundations of customer equity and relationship management, their strategic implications, and implementations in both B-2-B and B-2-C contexts, especially in the emerging era of big data. The course will provide insights into the role of measuring and managing customer equity and customer loyalty using online and offline media and channels. The objective of the course is to examine the strategic and analytical aspects in equal measure so that participants will have a deeper understanding of the power of customer equity and customer analytics, and how to put it to work effectively using data, big or small.",
      "sections": [
        {
          "sec_code": "0501",
          "instructors": [
            "Liye Ma"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      10,
                      0,
                      "Am"
                    ],
                    [
                      11,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "VMH",
                  "1412"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "BUMK759",
      "name": "Independent Study in Marketing",
      "credits": {
        "Range": [
          1,
          6
        ]
      },
      "gen_eds": null,
      "description": "",
      "sections": null
    },
    {
      "code": "BUMK766",
      "name": "Digital Analytics",
      "credits": {
        "Amount": 2
      },
      "gen_eds": null,
      "description": "Examines the process of developing, implementing and analyzing strategies for successfully marketing a variety of existing and potential products and services on the Internet. Special attention is devoted to the tools and techniques unique to the electronic media.",
      "sections": [
        {
          "sec_code": "0501",
          "instructors": [
            "Michael Trusov"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      10,
                      0,
                      "Am"
                    ],
                    [
                      11,
                      50,
                      "Am"
                    ]
                  ]
                },
                "location": [
                  "VMH",
                  "2505"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "BUMK770",
      "name": "Retail Analytics",
      "credits": {
        "Amount": 2
      },
      "gen_eds": null,
      "description": "Planning and implementing retail marketing strategies often involve sophisticated analytics.  This course will teach the analytical tools needed to develop retail strategies. Both store and non-store (catalog, Internet) retailing are discussed. Also, students will learn how to evaluate the impact of environmental trends in the consumer market, competition, the economy and technology on retail strategy in the U.S. and global market.",
      "sections": [
        {
          "sec_code": "0501",
          "instructors": [
            "Jie Zhang"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "MW": [
                    [
                      2,
                      0,
                      "Pm"
                    ],
                    [
                      3,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "VMH",
                  "1520"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "code": "BUMK776",
      "name": "Action Learning Project",
      "credits": {
        "Amount": 2
      },
      "gen_eds": null,
      "description": "Students analyze marketing data, report their findings and provide appropriate recommendations.",
      "sections": [
        {
          "sec_code": "0501",
          "instructors": [
            "Liye Ma"
          ],
          "class_meetings": [
            {
              "InPerson": {
                "classtime": {
                  "TuTh": [
                    [
                      12,
                      0,
                      "Pm"
                    ],
                    [
                      1,
                      50,
                      "Pm"
                    ]
                  ]
                },
                "location": [
                  "VMH",
                  "1511"
                ]
              }
            }
          ]
        }
      ]
    }
  ]
}